[Killed] LogicalOperator
app/auth/callback/route.ts:31:27
   supabase: Awaited<ReturnType<typeof createClient>>;
 }): Promise<MergeFinalizeResult> {
   const cookieStore = await cookies();
-  const mergeStateToken = cookieStore.get(MERGE_STATE_COOKIE)?.value ?? null;
+  const mergeStateToken = cookieStore.get(MERGE_STATE_COOKIE)?.value && null;
 
   if (!mergeStateToken) {
killedBy: /auth/callback merge finalization POST returns pending_auth when target user is anonymous
statusReason: expected 'no_pending_merge' to be 'pending_auth' // Object.is equality

[Killed] OptionalChaining
app/auth/callback/route.ts:31:27
   supabase: Awaited<ReturnType<typeof createClient>>;
 }): Promise<MergeFinalizeResult> {
   const cookieStore = await cookies();
-  const mergeStateToken = cookieStore.get(MERGE_STATE_COOKIE)?.value ?? null;
+  const mergeStateToken = cookieStore.get(MERGE_STATE_COOKIE).value ?? null;
 
   if (!mergeStateToken) {
killedBy: /auth/callback merge finalization POST returns no_pending_merge when merge cookie is absent
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] ConditionalExpression
app/auth/callback/route.ts:33:7
   const cookieStore = await cookies();
   const mergeStateToken = cookieStore.get(MERGE_STATE_COOKIE)?.value ?? null;
 
-  if (!mergeStateToken) {
+  if (true) {
     return { status: "no_pending_merge", shouldClearCookie: false };
   }
killedBy: /auth/callback merge finalization POST returns pending_auth when target user is anonymous
statusReason: expected 'no_pending_merge' to be 'pending_auth' // Object.is equality

[Killed] BlockStatement
app/auth/callback/route.ts:33:25
   const cookieStore = await cookies();
   const mergeStateToken = cookieStore.get(MERGE_STATE_COOKIE)?.value ?? null;
 
-  if (!mergeStateToken) {
-    return { status: "no_pending_merge", shouldClearCookie: false };
-  }
+  if (!mergeStateToken) {}
 
   const {
killedBy: /auth/callback merge finalization POST returns no_pending_merge when merge cookie is absent
statusReason: Cannot destructure property 'data' of '(intermediate value)' as it is undefined.

[Killed] BooleanLiteral
app/auth/callback/route.ts:34:61
   const mergeStateToken = cookieStore.get(MERGE_STATE_COOKIE)?.value ?? null;
 
   if (!mergeStateToken) {
-    return { status: "no_pending_merge", shouldClearCookie: false };
+    return { status: "no_pending_merge", shouldClearCookie: true };
   }
 
killedBy: /auth/callback merge finalization POST returns no_pending_merge when merge cookie is absent
statusReason: expected 'quran_circle_merge_state=; Path=/; Ma…' to be null

[Killed] ConditionalExpression
app/auth/callback/route.ts:41:7
     data: { user },
   } = await supabase.auth.getUser();
 
-  if (!user || user.is_anonymous) {
+  if (true) {
     return { status: "pending_auth", shouldClearCookie: false };
   }
killedBy: /auth/callback merge finalization POST returns invalid_merge_state and clears cookie for invalid token
statusReason: expected 'pending_auth' to be 'invalid_merge_state' // Object.is equality

[Killed] BooleanLiteral
app/auth/callback/route.ts:41:7
     data: { user },
   } = await supabase.auth.getUser();
 
-  if (!user || user.is_anonymous) {
+  if (user || user.is_anonymous) {
     return { status: "pending_auth", shouldClearCookie: false };
   }
killedBy: /auth/callback merge finalization POST returns invalid_merge_state and clears cookie for invalid token
statusReason: expected 'pending_auth' to be 'invalid_merge_state' // Object.is equality

[Killed] BooleanLiteral
app/auth/callback/route.ts:42:57
   } = await supabase.auth.getUser();
 
   if (!user || user.is_anonymous) {
-    return { status: "pending_auth", shouldClearCookie: false };
+    return { status: "pending_auth", shouldClearCookie: true };
   }
 
killedBy: /auth/callback merge finalization POST returns pending_auth when target user is anonymous
statusReason: expected 'quran_circle_merge_state=; Path=/; Ma…' to be null

[Killed] ObjectLiteral
app/auth/callback/route.ts:42:12
   } = await supabase.auth.getUser();
 
   if (!user || user.is_anonymous) {
-    return { status: "pending_auth", shouldClearCookie: false };
+    return {};
   }
 
killedBy: /auth/callback merge finalization POST returns pending_auth when target user is anonymous
statusReason: expected undefined to be 'pending_auth' // Object.is equality

[Killed] EqualityOperator
app/auth/callback/route.ts:47:24
 
   const sourceUserId = parseMergeStateToken(mergeStateToken);
 
-  if (!sourceUserId || sourceUserId === user.id) {
+  if (!sourceUserId || sourceUserId !== user.id) {
     return { status: "invalid_merge_state", shouldClearCookie: true };
   }
killedBy: /auth/callback merge finalization POST returns invalid_merge_state and clears cookie when source equals target
statusReason: expected 'merge_retryable_error' to be 'invalid_merge_state' // Object.is equality

[Killed] BlockStatement
app/auth/callback/route.ts:47:50
 
   const sourceUserId = parseMergeStateToken(mergeStateToken);
 
-  if (!sourceUserId || sourceUserId === user.id) {
-    return { status: "invalid_merge_state", shouldClearCookie: true };
-  }
+  if (!sourceUserId || sourceUserId === user.id) {}
 
   let data: unknown = null;
killedBy: /auth/callback merge finalization POST returns invalid_merge_state and clears cookie for invalid token
statusReason: expected 'merge_retryable_error' to be 'invalid_merge_state' // Object.is equality

[Killed] BooleanLiteral
app/auth/callback/route.ts:48:64
   const sourceUserId = parseMergeStateToken(mergeStateToken);
 
   if (!sourceUserId || sourceUserId === user.id) {
-    return { status: "invalid_merge_state", shouldClearCookie: true };
+    return { status: "invalid_merge_state", shouldClearCookie: false };
   }
 
killedBy: /auth/callback merge finalization POST returns invalid_merge_state and clears cookie for invalid token
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
app/auth/callback/route.ts:52:7
   }
 
   let data: unknown = null;
-  try {
-    const admin = createAdminClient();
-    const response = await admin.rpc("merge_anonymous_identity_for_target", {
-      p_source_user_id: sourceUserId,
-      p_target_user_id: user.id,
-    });
-    data = response.data;
-
-    if (response.error) {
-      console.error("Auth callback merge failed (retryable):", response.error.message);
-      return { status: "merge_retryable_error", shouldClearCookie: false };
-    }
-  } catch (error) {
+  try {} catch (error) {
     console.error("Auth callback merge failed (retryable):", error);
     return { status: "merge_retryable_error", shouldClearCookie: false };
killedBy: /auth/callback merge finalization POST calls privileged merge RPC and returns merged
statusReason: expected 'no_merge_required' to be 'merged' // Object.is equality

[Killed] StringLiteral
app/auth/callback/route.ts:54:38
   let data: unknown = null;
   try {
     const admin = createAdminClient();
-    const response = await admin.rpc("merge_anonymous_identity_for_target", {
+    const response = await admin.rpc("", {
       p_source_user_id: sourceUserId,
       p_target_user_id: user.id,
killedBy: /auth/callback merge finalization POST calls privileged merge RPC and returns merged
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received: 

  1st vi.fn() call:

  [
-   "merge_anonymous_identity_for_target",

[Killed] BlockStatement
app/auth/callback/route.ts:60:25
     });
     data = response.data;
 
-    if (response.error) {
-      console.error("Auth callback merge failed (retryable):", response.error.message);
-      return { status: "merge_retryable_error", shouldClearCookie: false };
-    }
+    if (response.error) {}
   } catch (error) {
     console.error("Auth callback merge failed (retryable):", error);
killedBy: /auth/callback merge finalization POST returns retryable status and keeps cookie when privileged RPC fails
statusReason: expected 'no_merge_required' to be 'merge_retryable_error' // Object.is equality

[Survived] StringLiteral
app/auth/callback/route.ts:61:21
     data = response.data;
 
     if (response.error) {
-      console.error("Auth callback merge failed (retryable):", response.error.message);
+      console.error("", response.error.message);
       return { status: "merge_retryable_error", shouldClearCookie: false };
     }

[Killed] BooleanLiteral
app/auth/callback/route.ts:62:68
 
     if (response.error) {
       console.error("Auth callback merge failed (retryable):", response.error.message);
-      return { status: "merge_retryable_error", shouldClearCookie: false };
+      return { status: "merge_retryable_error", shouldClearCookie: true };
     }
   } catch (error) {
killedBy: /auth/callback merge finalization POST returns retryable status and keeps cookie when privileged RPC fails
statusReason: expected 'quran_circle_merge_state=; Path=/; Ma…' to be null

[Killed] ObjectLiteral
app/auth/callback/route.ts:62:14
 
     if (response.error) {
       console.error("Auth callback merge failed (retryable):", response.error.message);
-      return { status: "merge_retryable_error", shouldClearCookie: false };
+      return {};
     }
   } catch (error) {
killedBy: /auth/callback merge finalization POST returns retryable status and keeps cookie when privileged RPC fails
statusReason: expected undefined to be 'merge_retryable_error' // Object.is equality

[NoCoverage] BlockStatement
app/auth/callback/route.ts:64:19
       console.error("Auth callback merge failed (retryable):", response.error.message);
       return { status: "merge_retryable_error", shouldClearCookie: false };
     }
-  } catch (error) {
-    console.error("Auth callback merge failed (retryable):", error);
-    return { status: "merge_retryable_error", shouldClearCookie: false };
-  }
+  } catch (error) {}
 
   const mergeResult = (data ?? {}) as {

[NoCoverage] BooleanLiteral
app/auth/callback/route.ts:66:66
     }
   } catch (error) {
     console.error("Auth callback merge failed (retryable):", error);
-    return { status: "merge_retryable_error", shouldClearCookie: false };
+    return { status: "merge_retryable_error", shouldClearCookie: true };
   }
 

[Killed] BooleanLiteral
app/auth/callback/route.ts:74:7
     reason?: string;
   };
 
-  if (!mergeResult.merged) {
+  if (mergeResult.merged) {
     return { status: "no_merge_required", shouldClearCookie: true };
   }
killedBy: /auth/callback merge finalization POST calls privileged merge RPC and returns merged
statusReason: expected 'no_merge_required' to be 'merged' // Object.is equality

[Killed] ConditionalExpression
app/auth/callback/route.ts:74:7
     reason?: string;
   };
 
-  if (!mergeResult.merged) {
+  if (true) {
     return { status: "no_merge_required", shouldClearCookie: true };
   }
killedBy: /auth/callback merge finalization POST calls privileged merge RPC and returns merged
statusReason: expected 'no_merge_required' to be 'merged' // Object.is equality

[Killed] BooleanLiteral
app/auth/callback/route.ts:75:62
   };
 
   if (!mergeResult.merged) {
-    return { status: "no_merge_required", shouldClearCookie: true };
+    return { status: "no_merge_required", shouldClearCookie: false };
   }
 
killedBy: /auth/callback merge finalization POST returns no_merge_required and clears cookie when merge result is false
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BooleanLiteral
app/auth/callback/route.ts:78:49
     return { status: "no_merge_required", shouldClearCookie: true };
   }
 
-  return { status: "merged", shouldClearCookie: true };
+  return { status: "merged", shouldClearCookie: false };
 }
 
killedBy: /auth/callback merge finalization POST calls privileged merge RPC and returns merged
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ObjectLiteral
app/auth/callback/route.ts:78:10
     return { status: "no_merge_required", shouldClearCookie: true };
   }
 
-  return { status: "merged", shouldClearCookie: true };
+  return {};
 }
 
killedBy: /auth/callback merge finalization POST calls privileged merge RPC and returns merged
statusReason: expected undefined to be 'merged' // Object.is equality

[Killed] LogicalOperator
app/auth/callback/route.ts:84:32
 export async function GET(request: Request) {
   const { searchParams, origin } = new URL(request.url);
   const code = searchParams.get("code");
-  const next = getSafeNextPath(searchParams.get("next") ?? undefined);
+  const next = getSafeNextPath(searchParams.get("next") && undefined);
   const isSecureOrigin = origin.startsWith("https://");
 
killedBy: /auth/callback merge finalization GET exchanges auth code and redirects to safe next path
statusReason: expected 'https://example.com/' to be 'https://example.com/browse' // Object.is equality

[Killed] StringLiteral
app/auth/callback/route.ts:84:49
 export async function GET(request: Request) {
   const { searchParams, origin } = new URL(request.url);
   const code = searchParams.get("code");
-  const next = getSafeNextPath(searchParams.get("next") ?? undefined);
+  const next = getSafeNextPath(searchParams.get("") ?? undefined);
   const isSecureOrigin = origin.startsWith("https://");
 
killedBy: /auth/callback merge finalization GET exchanges auth code and redirects to safe next path
statusReason: expected 'https://example.com/' to be 'https://example.com/browse' // Object.is equality

[Survived] MethodExpression
app/auth/callback/route.ts:85:26
   const { searchParams, origin } = new URL(request.url);
   const code = searchParams.get("code");
   const next = getSafeNextPath(searchParams.get("next") ?? undefined);
-  const isSecureOrigin = origin.startsWith("https://");
+  const isSecureOrigin = origin.endsWith("https://");
 
   if (code) {

[Survived] StringLiteral
app/auth/callback/route.ts:85:44
   const { searchParams, origin } = new URL(request.url);
   const code = searchParams.get("code");
   const next = getSafeNextPath(searchParams.get("next") ?? undefined);
-  const isSecureOrigin = origin.startsWith("https://");
+  const isSecureOrigin = origin.startsWith("");
 
   if (code) {

[Killed] ConditionalExpression
app/auth/callback/route.ts:87:7
   const next = getSafeNextPath(searchParams.get("next") ?? undefined);
   const isSecureOrigin = origin.startsWith("https://");
 
-  if (code) {
+  if (true) {
     const supabase = await createClient();
     const { error } = await supabase.auth.exchangeCodeForSession(code);
killedBy: /auth/callback merge finalization GET redirects with auth error when code is absent
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      null,

[Killed] BlockStatement
app/auth/callback/route.ts:87:13
   const next = getSafeNextPath(searchParams.get("next") ?? undefined);
   const isSecureOrigin = origin.startsWith("https://");
 
-  if (code) {
-    const supabase = await createClient();
-    const { error } = await supabase.auth.exchangeCodeForSession(code);
-    if (!error) {
-      const response = NextResponse.redirect(`${origin}${next}`);
-      const mergeResult = await finalizePendingMerge({ supabase });
-      if (mergeResult.shouldClearCookie) {
-        response.cookies.set(
-          MERGE_STATE_COOKIE,
-          "",
-          getMergeStateClearCookieOptions(isSecureOrigin)
-        );
-      }
-      return response;
-    }
-    console.error("Auth callback failed:", error.message);
-  }
+  if (code) {}
 
   const response = NextResponse.redirect(`${origin}/?error=auth`);
killedBy: /auth/callback merge finalization GET exchanges auth code and redirects to safe next path
statusReason: expected "vi.fn()" to be called with arguments: [ 'oauth-code' ]

Number of calls: 0

[Killed] ConditionalExpression
app/auth/callback/route.ts:90:9
   if (code) {
     const supabase = await createClient();
     const { error } = await supabase.auth.exchangeCodeForSession(code);
-    if (!error) {
+    if (true) {
       const response = NextResponse.redirect(`${origin}${next}`);
       const mergeResult = await finalizePendingMerge({ supabase });
killedBy: /auth/callback merge finalization GET redirects with auth error and clears cookie when exchange fails
statusReason: expected 'https://example.com/' to be 'https://example.com/?error=auth' // Object.is equality

[Killed] BooleanLiteral
app/auth/callback/route.ts:90:9
   if (code) {
     const supabase = await createClient();
     const { error } = await supabase.auth.exchangeCodeForSession(code);
-    if (!error) {
+    if (error) {
       const response = NextResponse.redirect(`${origin}${next}`);
       const mergeResult = await finalizePendingMerge({ supabase });
killedBy: /auth/callback merge finalization GET exchanges auth code and redirects to safe next path
statusReason: Cannot read properties of null (reading 'message')

[Killed] ConditionalExpression
app/auth/callback/route.ts:93:11
     if (!error) {
       const response = NextResponse.redirect(`${origin}${next}`);
       const mergeResult = await finalizePendingMerge({ supabase });
-      if (mergeResult.shouldClearCookie) {
+      if (false) {
         response.cookies.set(
           MERGE_STATE_COOKIE,
killedBy: /auth/callback merge finalization GET exchanges auth code and redirects to safe next path
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
app/auth/callback/route.ts:93:42
     if (!error) {
       const response = NextResponse.redirect(`${origin}${next}`);
       const mergeResult = await finalizePendingMerge({ supabase });
-      if (mergeResult.shouldClearCookie) {
-        response.cookies.set(
-          MERGE_STATE_COOKIE,
-          "",
-          getMergeStateClearCookieOptions(isSecureOrigin)
-        );
-      }
+      if (mergeResult.shouldClearCookie) {}
       return response;
     }
killedBy: /auth/callback merge finalization GET exchanges auth code and redirects to safe next path
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
app/auth/callback/route.ts:114:46
   return response;
 }
 
-export async function POST(request: Request) {
-  const isSecureOrigin = new URL(request.url).protocol === "https:";
-  const supabase = await createClient();
-  const mergeResult = await finalizePendingMerge({ supabase });
-  const response = NextResponse.json({ status: mergeResult.status });
-
-  response.headers.set("Cache-Control", "no-store");
-  response.headers.set("Pragma", "no-cache");
-  response.headers.set("Expires", "0");
-  if (mergeResult.shouldClearCookie) {
-    response.cookies.set(
-      MERGE_STATE_COOKIE,
-      "",
-      getMergeStateClearCookieOptions(isSecureOrigin)
-    );
-  }
-  return response;
-}
+export async function POST(request: Request) {}
 
killedBy: /auth/callback merge finalization POST returns no_pending_merge when merge cookie is absent
statusReason: Cannot read properties of undefined (reading 'json')

[Survived] ConditionalExpression
app/auth/callback/route.ts:115:26
 }
 
 export async function POST(request: Request) {
-  const isSecureOrigin = new URL(request.url).protocol === "https:";
+  const isSecureOrigin = true;
   const supabase = await createClient();
   const mergeResult = await finalizePendingMerge({ supabase });

[Survived] EqualityOperator
app/auth/callback/route.ts:115:26
 }
 
 export async function POST(request: Request) {
-  const isSecureOrigin = new URL(request.url).protocol === "https:";
+  const isSecureOrigin = new URL(request.url).protocol !== "https:";
   const supabase = await createClient();
   const mergeResult = await finalizePendingMerge({ supabase });

[Killed] ObjectLiteral
app/auth/callback/route.ts:117:50
 export async function POST(request: Request) {
   const isSecureOrigin = new URL(request.url).protocol === "https:";
   const supabase = await createClient();
-  const mergeResult = await finalizePendingMerge({ supabase });
+  const mergeResult = await finalizePendingMerge({});
   const response = NextResponse.json({ status: mergeResult.status });
 
killedBy: /auth/callback merge finalization POST returns pending_auth when target user is anonymous
statusReason: Cannot read properties of undefined (reading 'auth')

[Killed] ObjectLiteral
app/auth/callback/route.ts:118:38
   const isSecureOrigin = new URL(request.url).protocol === "https:";
   const supabase = await createClient();
   const mergeResult = await finalizePendingMerge({ supabase });
-  const response = NextResponse.json({ status: mergeResult.status });
+  const response = NextResponse.json({});
 
   response.headers.set("Cache-Control", "no-store");
killedBy: /auth/callback merge finalization POST returns no_pending_merge when merge cookie is absent
statusReason: expected undefined to be 'no_pending_merge' // Object.is equality

[Killed] ConditionalExpression
app/auth/callback/route.ts:123:7
   response.headers.set("Cache-Control", "no-store");
   response.headers.set("Pragma", "no-cache");
   response.headers.set("Expires", "0");
-  if (mergeResult.shouldClearCookie) {
+  if (true) {
     response.cookies.set(
       MERGE_STATE_COOKIE,
killedBy: /auth/callback merge finalization POST returns no_pending_merge when merge cookie is absent
statusReason: expected 'quran_circle_merge_state=; Path=/; Ma…' to be null

[Killed] BlockStatement
app/auth/callback/route.ts:123:38
   response.headers.set("Cache-Control", "no-store");
   response.headers.set("Pragma", "no-cache");
   response.headers.set("Expires", "0");
-  if (mergeResult.shouldClearCookie) {
-    response.cookies.set(
-      MERGE_STATE_COOKIE,
-      "",
-      getMergeStateClearCookieOptions(isSecureOrigin)
-    );
-  }
+  if (mergeResult.shouldClearCookie) {}
   return response;
 }
killedBy: /auth/callback merge finalization POST returns invalid_merge_state and clears cookie for invalid token
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string
