[Killed] BlockStatement
lib/actions/events.ts:66:64
   nextCursor: PublicEventsCursor | null;
 };
 
-function normalizeKhatmLimit(limit: number | null | undefined) {
-  if (limit === null) return null;
-  if (typeof limit !== "number" || !Number.isFinite(limit)) {
-    return EVENT_SNAPSHOT_DEFAULT_KHATM_LIMIT;
-  }
-  return Math.max(1, Math.min(EVENT_SNAPSHOT_MAX_KHATM_LIMIT, Math.trunc(limit)));
-}
+function normalizeKhatmLimit(limit: number | null | undefined) {}
 
 function normalizePublicEventsLimit(limit: number | null | undefined) {
killedBy: getEventByShortCodeResult returns event snapshot and forwards pagination args
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received: 

  1st vi.fn() call:

  [
    "get_event_snapshot_by_shortcode",

[Killed] EqualityOperator
lib/actions/events.ts:67:7
 };
 
 function normalizeKhatmLimit(limit: number | null | undefined) {
-  if (limit === null) return null;
+  if (limit !== null) return null;
   if (typeof limit !== "number" || !Number.isFinite(limit)) {
     return EVENT_SNAPSHOT_DEFAULT_KHATM_LIMIT;
killedBy: getEventByShortCodeResult returns event snapshot and forwards pagination args
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received: 

  1st vi.fn() call:

  [
    "get_event_snapshot_by_shortcode",

[Killed] ConditionalExpression
lib/actions/events.ts:67:7
 };
 
 function normalizeKhatmLimit(limit: number | null | undefined) {
-  if (limit === null) return null;
+  if (true) return null;
   if (typeof limit !== "number" || !Number.isFinite(limit)) {
     return EVENT_SNAPSHOT_DEFAULT_KHATM_LIMIT;
killedBy: getEventByShortCodeResult returns event snapshot and forwards pagination args
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received: 

  1st vi.fn() call:

  [
    "get_event_snapshot_by_shortcode",

[Killed] EqualityOperator
lib/actions/events.ts:68:7
 
 function normalizeKhatmLimit(limit: number | null | undefined) {
   if (limit === null) return null;
-  if (typeof limit !== "number" || !Number.isFinite(limit)) {
+  if (typeof limit === "number" || !Number.isFinite(limit)) {
     return EVENT_SNAPSHOT_DEFAULT_KHATM_LIMIT;
   }
killedBy: getEventByShortCodeResult returns event snapshot and forwards pagination args
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received: 

  1st vi.fn() call:

  [
    "get_event_snapshot_by_shortcode",

[Killed] ConditionalExpression
lib/actions/events.ts:68:7
 
 function normalizeKhatmLimit(limit: number | null | undefined) {
   if (limit === null) return null;
-  if (typeof limit !== "number" || !Number.isFinite(limit)) {
+  if (true) {
     return EVENT_SNAPSHOT_DEFAULT_KHATM_LIMIT;
   }
killedBy: getEventByShortCodeResult returns event snapshot and forwards pagination args
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received: 

  1st vi.fn() call:

  [
    "get_event_snapshot_by_shortcode",

[Killed] MethodExpression
lib/actions/events.ts:71:22
   if (typeof limit !== "number" || !Number.isFinite(limit)) {
     return EVENT_SNAPSHOT_DEFAULT_KHATM_LIMIT;
   }
-  return Math.max(1, Math.min(EVENT_SNAPSHOT_MAX_KHATM_LIMIT, Math.trunc(limit)));
+  return Math.max(1, Math.max(EVENT_SNAPSHOT_MAX_KHATM_LIMIT, Math.trunc(limit)));
 }
 
killedBy: getEventByShortCodeResult returns event snapshot and forwards pagination args
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received: 

  1st vi.fn() call:

  [
    "get_event_snapshot_by_shortcode",

[Killed] MethodExpression
lib/actions/events.ts:71:10
   if (typeof limit !== "number" || !Number.isFinite(limit)) {
     return EVENT_SNAPSHOT_DEFAULT_KHATM_LIMIT;
   }
-  return Math.max(1, Math.min(EVENT_SNAPSHOT_MAX_KHATM_LIMIT, Math.trunc(limit)));
+  return Math.min(1, Math.min(EVENT_SNAPSHOT_MAX_KHATM_LIMIT, Math.trunc(limit)));
 }
 
killedBy: getEventByShortCodeResult returns event snapshot and forwards pagination args
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received: 

  1st vi.fn() call:

  [
    "get_event_snapshot_by_shortcode",

[Killed] BlockStatement
lib/actions/events.ts:74:71
   return Math.max(1, Math.min(EVENT_SNAPSHOT_MAX_KHATM_LIMIT, Math.trunc(limit)));
 }
 
-function normalizePublicEventsLimit(limit: number | null | undefined) {
-  if (typeof limit !== "number" || !Number.isFinite(limit)) {
-    return DEFAULT_PUBLIC_EVENTS_PAGE_SIZE;
-  }
-  return Math.max(1, Math.min(MAX_PUBLIC_EVENTS_PAGE_SIZE, Math.trunc(limit)));
-}
+function normalizePublicEventsLimit(limit: number | null | undefined) {}
 
 function isAnonymousUser(user: { is_anonymous?: boolean } | null | undefined) {
killedBy: getPublicEventsPage/getPublicEvents uses default pagination args for invalid limit
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received: 

  1st vi.fn() call:

  [
    "list_public_events_with_progress",

[Killed] BooleanLiteral
lib/actions/events.ts:75:36
 }
 
 function normalizePublicEventsLimit(limit: number | null | undefined) {
-  if (typeof limit !== "number" || !Number.isFinite(limit)) {
+  if (typeof limit !== "number" || Number.isFinite(limit)) {
     return DEFAULT_PUBLIC_EVENTS_PAGE_SIZE;
   }
killedBy: getPublicEventsPage/getPublicEvents uses default pagination args for invalid limit
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received: 

  1st vi.fn() call:

  [
    "list_public_events_with_progress",

[Killed] LogicalOperator
lib/actions/events.ts:75:7
 }
 
 function normalizePublicEventsLimit(limit: number | null | undefined) {
-  if (typeof limit !== "number" || !Number.isFinite(limit)) {
+  if (typeof limit !== "number" && !Number.isFinite(limit)) {
     return DEFAULT_PUBLIC_EVENTS_PAGE_SIZE;
   }
killedBy: getPublicEventsPage/getPublicEvents uses default pagination args for invalid limit
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received: 

  1st vi.fn() call:

  [
    "list_public_events_with_progress",

[Killed] MethodExpression
lib/actions/events.ts:78:22
   if (typeof limit !== "number" || !Number.isFinite(limit)) {
     return DEFAULT_PUBLIC_EVENTS_PAGE_SIZE;
   }
-  return Math.max(1, Math.min(MAX_PUBLIC_EVENTS_PAGE_SIZE, Math.trunc(limit)));
+  return Math.max(1, Math.max(MAX_PUBLIC_EVENTS_PAGE_SIZE, Math.trunc(limit)));
 }
 
killedBy: getPublicEventsPage/getPublicEvents includes cursor params and computes hasMore + nextCursor
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received: 

  1st vi.fn() call:

  [
    "list_public_events_with_progress",

[Killed] MethodExpression
lib/actions/events.ts:78:10
   if (typeof limit !== "number" || !Number.isFinite(limit)) {
     return DEFAULT_PUBLIC_EVENTS_PAGE_SIZE;
   }
-  return Math.max(1, Math.min(MAX_PUBLIC_EVENTS_PAGE_SIZE, Math.trunc(limit)));
+  return Math.min(1, Math.min(MAX_PUBLIC_EVENTS_PAGE_SIZE, Math.trunc(limit)));
 }
 
killedBy: getPublicEventsPage/getPublicEvents includes cursor params and computes hasMore + nextCursor
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received: 

  1st vi.fn() call:

  [
    "list_public_events_with_progress",

[Killed] BlockStatement
lib/actions/events.ts:81:79
   return Math.max(1, Math.min(MAX_PUBLIC_EVENTS_PAGE_SIZE, Math.trunc(limit)));
 }
 
-function isAnonymousUser(user: { is_anonymous?: boolean } | null | undefined) {
-  return Boolean(user?.is_anonymous);
-}
+function isAnonymousUser(user: { is_anonymous?: boolean } | null | undefined) {}
 
 type RpcErrorLike = {
killedBy: getUserEvents returns empty list for no user or anonymous user
statusReason: Cannot destructure property 'data' of '(intermediate value)' as it is undefined.

[Survived] OptionalChaining
lib/actions/events.ts:82:18
 }
 
 function isAnonymousUser(user: { is_anonymous?: boolean } | null | undefined) {
-  return Boolean(user?.is_anonymous);
+  return Boolean(user.is_anonymous);
 }
 

[Killed] BlockStatement
lib/actions/events.ts:92:59
   hint?: string | null;
 };
 
-function isShortCodeCollision(error: RpcErrorLike | null) {
-  if (!error || error.code !== "23505") return false;
-
-  const fingerprint = `${error.message ?? ""} ${error.details ?? ""} ${
-    error.hint ?? ""
-  }`.toLowerCase();
-
-  return (
-    fingerprint.includes("short_code") ||
-    fingerprint.includes("events_short_code") ||
-    fingerprint.includes("events_short_code_key")
-  );
-}
+function isShortCodeCollision(error: RpcErrorLike | null) {}
 
 function logUserEventsError(
killedBy: createEvent short-code retry behavior retries when the database error is a short_code collision
statusReason: expected { Object (error) } to deeply equal { Object (data) }

[Killed] BooleanLiteral
lib/actions/events.ts:93:7
 };
 
 function isShortCodeCollision(error: RpcErrorLike | null) {
-  if (!error || error.code !== "23505") return false;
+  if (error || error.code !== "23505") return false;
 
   const fingerprint = `${error.message ?? ""} ${error.details ?? ""} ${
killedBy: createEvent short-code retry behavior retries when the database error is a short_code collision
statusReason: expected { Object (error) } to deeply equal { Object (data) }

[Killed] LogicalOperator
lib/actions/events.ts:93:7
 };
 
 function isShortCodeCollision(error: RpcErrorLike | null) {
-  if (!error || error.code !== "23505") return false;
+  if (!error && error.code !== "23505") return false;
 
   const fingerprint = `${error.message ?? ""} ${error.details ?? ""} ${
killedBy: createEvent short-code retry behavior uses default values and fallback error when rpc returns empty data
statusReason: Cannot read properties of null (reading 'code')

[Killed] MethodExpression
lib/actions/events.ts:95:23
 function isShortCodeCollision(error: RpcErrorLike | null) {
   if (!error || error.code !== "23505") return false;
 
-  const fingerprint = `${error.message ?? ""} ${error.details ?? ""} ${
-    error.hint ?? ""
-  }`.toLowerCase();
+  const fingerprint = `${error.message ?? ""} ${error.details ?? ""} ${error.hint ?? ""}`.toUpperCase();
 
   return (
killedBy: createEvent short-code retry behavior retries when the database error is a short_code collision
statusReason: expected { Object (error) } to deeply equal { Object (data) }

[Survived] LogicalOperator
lib/actions/events.ts:95:49
 function isShortCodeCollision(error: RpcErrorLike | null) {
   if (!error || error.code !== "23505") return false;
 
-  const fingerprint = `${error.message ?? ""} ${error.details ?? ""} ${
+  const fingerprint = `${error.message ?? ""} ${error.details && ""} ${
     error.hint ?? ""
   }`.toLowerCase();

[Survived] LogicalOperator
lib/actions/events.ts:96:5
   if (!error || error.code !== "23505") return false;
 
   const fingerprint = `${error.message ?? ""} ${error.details ?? ""} ${
-    error.hint ?? ""
+    error.hint && ""
   }`.toLowerCase();
 

[Killed] ConditionalExpression
lib/actions/events.ts:100:5
   }`.toLowerCase();
 
   return (
-    fingerprint.includes("short_code") ||
-    fingerprint.includes("events_short_code") ||
-    fingerprint.includes("events_short_code_key")
+    false
   );
 }
killedBy: createEvent short-code retry behavior retries when the database error is a short_code collision
statusReason: expected { Object (error) } to deeply equal { Object (data) }

[Killed] ConditionalExpression
lib/actions/events.ts:100:5
   }`.toLowerCase();
 
   return (
-    fingerprint.includes("short_code") ||
-    fingerprint.includes("events_short_code") ||
-    fingerprint.includes("events_short_code_key")
+    true
   );
 }
killedBy: createEvent short-code retry behavior does not retry for unrelated 23505 errors
statusReason: Cannot destructure property 'data' of '(intermediate value)' as it is undefined.

[Survived] BlockStatement
lib/actions/events.ts:115:3
     hint?: string | null;
   } | null,
   context: Record<string, unknown> = {}
-) {
-  if (!error) return;
-  console.error("[getUserEvents] query failed", {
-    step,
-    code: error.code,
-    message: error.message,
-    details: error.details ?? null,
-    hint: error.hint ?? null,
-    ...context,
-  });
-}
+) {}
 
 export async function createEvent(formData: {

[Survived] BooleanLiteral
lib/actions/events.ts:116:7
   } | null,
   context: Record<string, unknown> = {}
 ) {
-  if (!error) return;
+  if (error) return;
   console.error("[getUserEvents] query failed", {
     step,

[Survived] ConditionalExpression
lib/actions/events.ts:116:7
   } | null,
   context: Record<string, unknown> = {}
 ) {
-  if (!error) return;
+  if (true) return;
   console.error("[getUserEvents] query failed", {
     step,

[Survived] LogicalOperator
lib/actions/events.ts:121:14
     step,
     code: error.code,
     message: error.message,
-    details: error.details ?? null,
+    details: error.details && null,
     hint: error.hint ?? null,
     ...context,

[Survived] LogicalOperator
lib/actions/events.ts:122:11
     code: error.code,
     message: error.message,
     details: error.details ?? null,
-    hint: error.hint ?? null,
+    hint: error.hint && null,
     ...context,
   });

[Killed] ConditionalExpression
lib/actions/events.ts:133:7
   isPublic?: boolean;
 }) {
   const parsed = createEventSchema.safeParse(formData);
-  if (!parsed.success) return { error: "Invalid input" };
+  if (true) return { error: "Invalid input" };
   const { name, description, isPublic } = parsed.data;
 
killedBy: createEvent short-code retry behavior retries when the database error is a short_code collision
statusReason: expected { error: 'Invalid input' } to deeply equal { Object (data) }

[Killed] ConditionalExpression
lib/actions/events.ts:133:7
   isPublic?: boolean;
 }) {
   const parsed = createEventSchema.safeParse(formData);
-  if (!parsed.success) return { error: "Invalid input" };
+  if (false) return { error: "Invalid input" };
   const { name, description, isPublic } = parsed.data;
 
killedBy: createEvent short-code retry behavior rejects invalid payload before touching supabase
statusReason: Cannot destructure property 'name' of 'parsed.data' as it is undefined.

[Killed] LogicalOperator
lib/actions/events.ts:141:7
     data: { user },
   } = await supabase.auth.getUser();
 
-  if (!user || isAnonymousUser(user)) {
+  if (!user && isAnonymousUser(user)) {
     return { error: "Sign in required to create a circle." };
   }
killedBy: createEvent short-code retry behavior requires a non-anonymous authenticated user
statusReason: Cannot destructure property 'data' of '(intermediate value)' as it is undefined.

[Killed] ConditionalExpression
lib/actions/events.ts:141:7
     data: { user },
   } = await supabase.auth.getUser();
 
-  if (!user || isAnonymousUser(user)) {
+  if (true) {
     return { error: "Sign in required to create a circle." };
   }
killedBy: createEvent short-code retry behavior retries when the database error is a short_code collision
statusReason: expected { Object (error) } to deeply equal { Object (data) }

[Killed] EqualityOperator
lib/actions/events.ts:149:26
   let shortCode = generateShortCode(8);
   let lastShortCodeError: RpcErrorLike | null = null;
 
-  for (let attempts = 0; attempts < maxAttempts; attempts++) {
+  for (let attempts = 0; attempts >= maxAttempts; attempts++) {
     const { data, error } = await supabase
       .rpc("create_event_with_initial_khatm", {
killedBy: createEvent short-code retry behavior retries when the database error is a short_code collision
statusReason: expected { Object (error) } to deeply equal { Object (data) }

[Killed] EqualityOperator
lib/actions/events.ts:149:26
   let shortCode = generateShortCode(8);
   let lastShortCodeError: RpcErrorLike | null = null;
 
-  for (let attempts = 0; attempts < maxAttempts; attempts++) {
+  for (let attempts = 0; attempts <= maxAttempts; attempts++) {
     const { data, error } = await supabase
       .rpc("create_event_with_initial_khatm", {
killedBy: createEvent short-code retry behavior returns unique-link failure after exhausting short_code retries
statusReason: Cannot destructure property 'data' of '(intermediate value)' as it is undefined.

[Killed] StringLiteral
lib/actions/events.ts:151:12
 
   for (let attempts = 0; attempts < maxAttempts; attempts++) {
     const { data, error } = await supabase
-      .rpc("create_event_with_initial_khatm", {
+      .rpc("", {
         p_name: name,
         p_description: description || null,
killedBy: createEvent short-code retry behavior uses default values and fallback error when rpc returns empty data
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received: 

  1st vi.fn() call:

@@ -1,7 +1,7 @@
  [

[Killed] LogicalOperator
lib/actions/events.ts:153:24
     const { data, error } = await supabase
       .rpc("create_event_with_initial_khatm", {
         p_name: name,
-        p_description: description || null,
+        p_description: description && null,
         p_is_public: isPublic ?? false,
         p_short_code: shortCode,
killedBy: createEvent short-code retry behavior retries when the database error is a short_code collision
statusReason: expected { p_name: 'Smoke Circle', …(3) } to deeply equal { p_name: 'Smoke Circle', …(3) }

[Killed] ConditionalExpression
lib/actions/events.ts:153:24
     const { data, error } = await supabase
       .rpc("create_event_with_initial_khatm", {
         p_name: name,
-        p_description: description || null,
+        p_description: true,
         p_is_public: isPublic ?? false,
         p_short_code: shortCode,
killedBy: createEvent short-code retry behavior retries when the database error is a short_code collision
statusReason: expected { p_name: 'Smoke Circle', …(3) } to deeply equal { p_name: 'Smoke Circle', …(3) }

[Killed] LogicalOperator
lib/actions/events.ts:154:22
       .rpc("create_event_with_initial_khatm", {
         p_name: name,
         p_description: description || null,
-        p_is_public: isPublic ?? false,
+        p_is_public: isPublic && false,
         p_short_code: shortCode,
       })
killedBy: createEvent short-code retry behavior uses default values and fallback error when rpc returns empty data
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received: 

  1st vi.fn() call:

  [
    "create_event_with_initial_khatm",

[Killed] BooleanLiteral
lib/actions/events.ts:154:34
       .rpc("create_event_with_initial_khatm", {
         p_name: name,
         p_description: description || null,
-        p_is_public: isPublic ?? false,
+        p_is_public: isPublic ?? true,
         p_short_code: shortCode,
       })
killedBy: createEvent short-code retry behavior uses default values and fallback error when rpc returns empty data
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received: 

  1st vi.fn() call:

  [
    "create_event_with_initial_khatm",

[Killed] BooleanLiteral
lib/actions/events.ts:161:9
 
     const createdEvent = data as { event_id: string; short_code: string } | null;
 
-    if (!error && createdEvent) {
+    if (error && createdEvent) {
       revalidatePath("/");
       revalidatePath("/browse");
killedBy: createEvent short-code retry behavior retries when the database error is a short_code collision
statusReason: expected { Object (error) } to deeply equal { Object (data) }

[Killed] ConditionalExpression
lib/actions/events.ts:161:9
 
     const createdEvent = data as { event_id: string; short_code: string } | null;
 
-    if (!error && createdEvent) {
+    if (false) {
       revalidatePath("/");
       revalidatePath("/browse");
killedBy: createEvent short-code retry behavior retries when the database error is a short_code collision
statusReason: expected { Object (error) } to deeply equal { Object (data) }

[Killed] StringLiteral
lib/actions/events.ts:164:22
     if (!error && createdEvent) {
       revalidatePath("/");
       revalidatePath("/browse");
-      revalidatePath("/my-circles");
+      revalidatePath("");
       return {
         data: {
killedBy: createEvent short-code retry behavior retries when the database error is a short_code collision
statusReason: expected "vi.fn()" to be called with arguments: [ '/my-circles' ]

Received: 

  1st vi.fn() call:

  [
-   "/my-circles",

[Killed] ConditionalExpression
lib/actions/events.ts:173:9
       };
     }
 
-    if (isShortCodeCollision(error)) {
+    if (true) {
       lastShortCodeError = error;
       shortCode = generateShortCode(8);
killedBy: createEvent short-code retry behavior does not retry for unrelated 23505 errors
statusReason: Cannot destructure property 'data' of '(intermediate value)' as it is undefined.

[Killed] ConditionalExpression
lib/actions/events.ts:173:9
       };
     }
 
-    if (isShortCodeCollision(error)) {
+    if (false) {
       lastShortCodeError = error;
       shortCode = generateShortCode(8);
killedBy: createEvent short-code retry behavior retries when the database error is a short_code collision
statusReason: expected { Object (error) } to deeply equal { Object (data) }

[Killed] OptionalChaining
lib/actions/events.ts:187:21
         hint: error.hint ?? null,
       });
     }
-    return { error: error?.message ?? "Failed to create event. Please try again." };
+    return { error: error.message ?? "Failed to create event. Please try again." };
   }
 
killedBy: createEvent short-code retry behavior uses default values and fallback error when rpc returns empty data
statusReason: Cannot read properties of null (reading 'message')

[Killed] LogicalOperator
lib/actions/events.ts:187:21
         hint: error.hint ?? null,
       });
     }
-    return { error: error?.message ?? "Failed to create event. Please try again." };
+    return { error: error?.message && "Failed to create event. Please try again." };
   }
 
killedBy: createEvent short-code retry behavior does not retry for unrelated 23505 errors
statusReason: expected { Object (error) } to deeply equal { Object (error) }

[Survived] StringLiteral
lib/actions/events.ts:190:17
     return { error: error?.message ?? "Failed to create event. Please try again." };
   }
 
-  console.error("[createEvent] exhausted short-code retries", {
+  console.error("", {
     attempts: maxAttempts,
     code: lastShortCodeError?.code,

[Survived] OptionalChaining
lib/actions/events.ts:192:11
 
   console.error("[createEvent] exhausted short-code retries", {
     attempts: maxAttempts,
-    code: lastShortCodeError?.code,
+    code: lastShortCodeError.code,
     message: lastShortCodeError?.message,
     details: lastShortCodeError?.details ?? null,

[Survived] OptionalChaining
lib/actions/events.ts:193:14
   console.error("[createEvent] exhausted short-code retries", {
     attempts: maxAttempts,
     code: lastShortCodeError?.code,
-    message: lastShortCodeError?.message,
+    message: lastShortCodeError.message,
     details: lastShortCodeError?.details ?? null,
     hint: lastShortCodeError?.hint ?? null,

[Survived] OptionalChaining
lib/actions/events.ts:194:14
     attempts: maxAttempts,
     code: lastShortCodeError?.code,
     message: lastShortCodeError?.message,
-    details: lastShortCodeError?.details ?? null,
+    details: lastShortCodeError.details ?? null,
     hint: lastShortCodeError?.hint ?? null,
   });

[Survived] LogicalOperator
lib/actions/events.ts:194:14
     attempts: maxAttempts,
     code: lastShortCodeError?.code,
     message: lastShortCodeError?.message,
-    details: lastShortCodeError?.details ?? null,
+    details: lastShortCodeError?.details && null,
     hint: lastShortCodeError?.hint ?? null,
   });

[Survived] OptionalChaining
lib/actions/events.ts:195:11
     code: lastShortCodeError?.code,
     message: lastShortCodeError?.message,
     details: lastShortCodeError?.details ?? null,
-    hint: lastShortCodeError?.hint ?? null,
+    hint: lastShortCodeError.hint ?? null,
   });
   return { error: "Failed to create a unique link. Please try again." };

[Survived] LogicalOperator
lib/actions/events.ts:195:11
     code: lastShortCodeError?.code,
     message: lastShortCodeError?.message,
     details: lastShortCodeError?.details ?? null,
-    hint: lastShortCodeError?.hint ?? null,
+    hint: lastShortCodeError?.hint && null,
   });
   return { error: "Failed to create a unique link. Please try again." };

[Killed] ObjectLiteral
lib/actions/events.ts:197:10
     details: lastShortCodeError?.details ?? null,
     hint: lastShortCodeError?.hint ?? null,
   });
-  return { error: "Failed to create a unique link. Please try again." };
+  return {};
 }
 
killedBy: createEvent short-code retry behavior returns unique-link failure after exhausting short_code retries
statusReason: expected {} to deeply equal { Object (error) }

[Killed] ConditionalExpression
lib/actions/events.ts:204:7
   shortCode: string,
   query: EventSnapshotQuery = {}
 ): Promise<EventLookupResult> {
-  if (!shortCodeSchema.safeParse(shortCode).success) {
+  if (false) {
     return {
       ok: false,
killedBy: getEventByShortCodeResult returns invalid_short_code when input fails validation
statusReason: Cannot read properties of undefined (reading 'rpc')

[Killed] ConditionalExpression
lib/actions/events.ts:204:7
   shortCode: string,
   query: EventSnapshotQuery = {}
 ): Promise<EventLookupResult> {
-  if (!shortCodeSchema.safeParse(shortCode).success) {
+  if (true) {
     return {
       ok: false,
killedBy: getEventByShortCodeResult returns invalid_cursor when beforeKhatmNumber is invalid
statusReason: expected { ok: false, …(3) } to deeply equal { ok: false, …(3) }

[Killed] ObjectLiteral
lib/actions/events.ts:205:12
   query: EventSnapshotQuery = {}
 ): Promise<EventLookupResult> {
   if (!shortCodeSchema.safeParse(shortCode).success) {
-    return {
-      ok: false,
-      code: "invalid_short_code",
-      message: "Invalid shortCode",
-      status: 400,
-    };
+    return {};
   }
 
killedBy: getEventByShortCodeResult returns invalid_short_code when input fails validation
statusReason: expected {} to deeply equal { ok: false, …(3) }

[Killed] StringLiteral
lib/actions/events.ts:207:13
   if (!shortCodeSchema.safeParse(shortCode).success) {
     return {
       ok: false,
-      code: "invalid_short_code",
+      code: "",
       message: "Invalid shortCode",
       status: 400,
killedBy: getEventByShortCodeResult returns invalid_short_code when input fails validation
statusReason: expected { ok: false, code: '', …(2) } to deeply equal { ok: false, …(3) }

[Killed] ConditionalExpression
lib/actions/events.ts:214:5
   }
 
   const beforeKhatmNumber =
-    query.beforeKhatmNumber === null || query.beforeKhatmNumber === undefined
+    true
       ? null
       : Math.trunc(query.beforeKhatmNumber);
killedBy: getEventByShortCodeResult returns invalid_cursor when beforeKhatmNumber is invalid
statusReason: Cannot read properties of undefined (reading 'rpc')

[Killed] EqualityOperator
lib/actions/events.ts:214:41
   }
 
   const beforeKhatmNumber =
-    query.beforeKhatmNumber === null || query.beforeKhatmNumber === undefined
+    query.beforeKhatmNumber === null || query.beforeKhatmNumber !== undefined
       ? null
       : Math.trunc(query.beforeKhatmNumber);
killedBy: getEventByShortCodeResult returns invalid_cursor when beforeKhatmNumber is invalid
statusReason: Cannot read properties of undefined (reading 'rpc')

[Killed] ConditionalExpression
lib/actions/events.ts:217:37
     query.beforeKhatmNumber === null || query.beforeKhatmNumber === undefined
       ? null
       : Math.trunc(query.beforeKhatmNumber);
-  if (beforeKhatmNumber !== null && beforeKhatmNumber < 1) {
+  if (beforeKhatmNumber !== null && true) {
     return {
       ok: false,
killedBy: getEventByShortCodeResult returns event snapshot and forwards pagination args
statusReason: expected { ok: false, …(3) } to deeply equal { ok: true, …(1) }

[Killed] EqualityOperator
lib/actions/events.ts:217:7
     query.beforeKhatmNumber === null || query.beforeKhatmNumber === undefined
       ? null
       : Math.trunc(query.beforeKhatmNumber);
-  if (beforeKhatmNumber !== null && beforeKhatmNumber < 1) {
+  if (beforeKhatmNumber === null && beforeKhatmNumber < 1) {
     return {
       ok: false,
killedBy: getEventByShortCodeResult returns invalid_cursor when beforeKhatmNumber is invalid
statusReason: Cannot read properties of undefined (reading 'rpc')

[Killed] ObjectLiteral
lib/actions/events.ts:228:46
 
   const khatmLimit = normalizeKhatmLimit(query.khatmLimit);
   const supabase = await createClient();
-  const rpcParams: Record<string, unknown> = {
-    p_short_code: shortCode,
-    p_khatm_limit: khatmLimit,
-  };
+  const rpcParams: Record<string, unknown> = {};
   if (beforeKhatmNumber !== null) {
     rpcParams.p_before_khatm_number = beforeKhatmNumber;
killedBy: getEventByShortCodeResult returns event snapshot and forwards pagination args
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received: 

  1st vi.fn() call:

  [
    "get_event_snapshot_by_shortcode",

[Killed] ConditionalExpression
lib/actions/events.ts:232:7
     p_short_code: shortCode,
     p_khatm_limit: khatmLimit,
   };
-  if (beforeKhatmNumber !== null) {
+  if (false) {
     rpcParams.p_before_khatm_number = beforeKhatmNumber;
   }
killedBy: getEventByShortCodeResult returns event snapshot and forwards pagination args
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received: 

  1st vi.fn() call:

  [
    "get_event_snapshot_by_shortcode",
