[Killed] BlockStatement
lib/actions/events.ts:232:35
     p_short_code: shortCode,
     p_khatm_limit: khatmLimit,
   };
-  if (beforeKhatmNumber !== null) {
-    rpcParams.p_before_khatm_number = beforeKhatmNumber;
-  }
+  if (beforeKhatmNumber !== null) {}
 
   const { data, error } = await supabase.rpc(
killedBy: getEventByShortCodeResult returns event snapshot and forwards pagination args
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received: 

  1st vi.fn() call:

  [
    "get_event_snapshot_by_shortcode",

[Killed] BlockStatement
lib/actions/events.ts:241:14
     rpcParams
   );
 
-  if (error) {
-    console.error("[getEventByShortCodeResult] snapshot lookup failed", {
-      shortCode,
-      code: error.code,
-      message: error.message,
-      details: error.details ?? null,
-      hint: error.hint ?? null,
-    });
-    return {
-      ok: false,
-      code: "upstream_error",
-      message: "Failed to load event snapshot",
-      status: 502,
-    };
-  }
+  if (error) {}
 
   if (!data) {
killedBy: getEventByShortCodeResult returns upstream_error on RPC failure
statusReason: expected { ok: false, code: 'not_found', …(2) } to deeply equal { ok: false, …(3) }

[Killed] ConditionalExpression
lib/actions/events.ts:257:7
     };
   }
 
-  if (!data) {
+  if (false) {
     return {
       ok: false,
killedBy: getEventByShortCodeResult returns not_found when RPC data is empty
statusReason: expected { ok: true, data: null } to deeply equal { ok: false, code: 'not_found', …(2) }

[Killed] BooleanLiteral
lib/actions/events.ts:266:16
     };
   }
 
-  return { ok: true, data: data as EventSnapshot };
+  return { ok: false, data: data as EventSnapshot };
 }
 
killedBy: getEventByShortCodeResult returns event snapshot and forwards pagination args
statusReason: expected { ok: false, …(1) } to deeply equal { ok: true, …(1) }

[Killed] BlockStatement
lib/actions/events.ts:272:34
 export async function getEventByShortCode(
   shortCode: string,
   query: EventSnapshotQuery = {}
-): Promise<EventSnapshot | null> {
-  const result = await getEventByShortCodeResult(shortCode, query);
-  if (!result.ok) return null;
-  return result.data;
-}
+): Promise<EventSnapshot | null> {}
 
 export async function ensureEventMembershipForShortCode(shortCode: string) {
killedBy: getEventByShortCode keeps null contract for non-ok result
statusReason: expected undefined to be null

[Killed] BooleanLiteral
lib/actions/events.ts:274:7
   query: EventSnapshotQuery = {}
 ): Promise<EventSnapshot | null> {
   const result = await getEventByShortCodeResult(shortCode, query);
-  if (!result.ok) return null;
+  if (result.ok) return null;
   return result.data;
 }
killedBy: getEventByShortCode keeps null contract for non-ok result
statusReason: expected undefined to be null

[Killed] ConditionalExpression
lib/actions/events.ts:274:7
   query: EventSnapshotQuery = {}
 ): Promise<EventSnapshot | null> {
   const result = await getEventByShortCodeResult(shortCode, query);
-  if (!result.ok) return null;
+  if (false) return null;
   return result.data;
 }
killedBy: getEventByShortCode keeps null contract for non-ok result
statusReason: expected undefined to be null

[Killed] ConditionalExpression
lib/actions/events.ts:279:7
 }
 
 export async function ensureEventMembershipForShortCode(shortCode: string) {
-  if (!shortCodeSchema.safeParse(shortCode).success) {
+  if (false) {
     return { error: "Invalid input" };
   }
killedBy: ensureEventMembershipForShortCode returns validation error for invalid shortcode
statusReason: Cannot read properties of undefined (reading 'auth')

[Killed] BlockStatement
lib/actions/events.ts:279:54
 }
 
 export async function ensureEventMembershipForShortCode(shortCode: string) {
-  if (!shortCodeSchema.safeParse(shortCode).success) {
-    return { error: "Invalid input" };
-  }
+  if (!shortCodeSchema.safeParse(shortCode).success) {}
 
   const supabase = await createClient();
killedBy: ensureEventMembershipForShortCode returns validation error for invalid shortcode
statusReason: Cannot read properties of undefined (reading 'auth')

[Killed] BlockStatement
lib/actions/events.ts:288:14
     data: { user },
   } = await supabase.auth.getUser();
 
-  if (!user) {
-    return { error: "Active session required" };
-  }
+  if (!user) {}
 
   const { data, error } = await supabase.rpc("ensure_event_membership", {
killedBy: ensureEventMembershipForShortCode requires an active session user
statusReason: Cannot destructure property 'data' of '(intermediate value)' as it is undefined.

[Killed] StringLiteral
lib/actions/events.ts:289:21
   } = await supabase.auth.getUser();
 
   if (!user) {
-    return { error: "Active session required" };
+    return { error: "" };
   }
 
killedBy: ensureEventMembershipForShortCode requires an active session user
statusReason: expected { error: '' } to deeply equal { error: 'Active session required' }

[Killed] BlockStatement
lib/actions/events.ts:296:14
     p_short_code: shortCode,
   });
 
-  if (error) {
-    return { error: error.message || "Failed to initialize event membership" };
-  }
+  if (error) {}
 
   if (!data) {
killedBy: ensureEventMembershipForShortCode returns rpc errors
statusReason: expected { error: 'Event not found' } to deeply equal { error: 'membership failed' }

[Killed] LogicalOperator
lib/actions/events.ts:297:21
   });
 
   if (error) {
-    return { error: error.message || "Failed to initialize event membership" };
+    return { error: error.message && "Failed to initialize event membership" };
   }
 
killedBy: ensureEventMembershipForShortCode returns rpc errors
statusReason: expected { Object (error) } to deeply equal { error: 'membership failed' }

[Killed] ConditionalExpression
lib/actions/events.ts:297:21
   });
 
   if (error) {
-    return { error: error.message || "Failed to initialize event membership" };
+    return { error: true };
   }
 
killedBy: ensureEventMembershipForShortCode returns rpc errors
statusReason: expected { error: true } to deeply equal { error: 'membership failed' }

[Killed] ArithmeticOperator
lib/actions/events.ts:315:22
   cursor?: PublicEventsCursor | null;
 } = {}): Promise<PublicEventsPage> {
   const normalizedLimit = normalizePublicEventsLimit(limit);
-  const queryLimit = normalizedLimit + 1;
+  const queryLimit = normalizedLimit - 1;
   const supabase = await createClient();
 
killedBy: getPublicEventsPage/getPublicEvents uses default pagination args for invalid limit
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received: 

  1st vi.fn() call:

  [
    "list_public_events_with_progress",

[Killed] ObjectLiteral
lib/actions/events.ts:318:46
   const queryLimit = normalizedLimit + 1;
   const supabase = await createClient();
 
-  const rpcParams: Record<string, unknown> = {
-    p_limit: queryLimit,
-  };
+  const rpcParams: Record<string, unknown> = {};
   if (cursor) {
     rpcParams.p_before_created_at = cursor.createdAt;
killedBy: getPublicEventsPage/getPublicEvents uses default pagination args for invalid limit
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received: 

  1st vi.fn() call:

  [
    "list_public_events_with_progress",

[Killed] ConditionalExpression
lib/actions/events.ts:321:7
   const rpcParams: Record<string, unknown> = {
     p_limit: queryLimit,
   };
-  if (cursor) {
+  if (false) {
     rpcParams.p_before_created_at = cursor.createdAt;
     rpcParams.p_before_id = cursor.id;
killedBy: getPublicEventsPage/getPublicEvents includes cursor params and computes hasMore + nextCursor
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received: 

  1st vi.fn() call:

  [
    "list_public_events_with_progress",

[Killed] ConditionalExpression
lib/actions/events.ts:321:7
   const rpcParams: Record<string, unknown> = {
     p_limit: queryLimit,
   };
-  if (cursor) {
+  if (true) {
     rpcParams.p_before_created_at = cursor.createdAt;
     rpcParams.p_before_id = cursor.id;
killedBy: getPublicEventsPage/getPublicEvents uses default pagination args for invalid limit
statusReason: Cannot read properties of null (reading 'createdAt')

[Killed] BooleanLiteral
lib/actions/events.ts:331:16
     rpcParams
   );
 
-  if (error || !data) {
+  if (error || data) {
     if (error) {
       console.error("[getPublicEventsPage] list_public_events_with_progress failed", {
killedBy: getPublicEventsPage/getPublicEvents includes cursor params and computes hasMore + nextCursor
statusReason: expected { events: [], hasMore: false, …(1) } to deeply equal { events: [ …(2) ], …(2) }

[Killed] BlockStatement
lib/actions/events.ts:331:23
     rpcParams
   );
 
-  if (error || !data) {
-    if (error) {
-      console.error("[getPublicEventsPage] list_public_events_with_progress failed", {
-        code: error.code,
-        message: error.message,
-        details: error.details ?? null,
-        hint: error.hint ?? null,
-      });
-    }
-    return { events: [], hasMore: false, nextCursor: null };
-  }
+  if (error || !data) {}
 
   const mapped = (data as PublicEventWithProgress[]).map((event) => ({
killedBy: getPublicEventsPage/getPublicEvents returns empty results when rpc fails
statusReason: Cannot read properties of null (reading 'map')

[Survived] ConditionalExpression
lib/actions/events.ts:332:9
   );
 
   if (error || !data) {
-    if (error) {
+    if (true) {
       console.error("[getPublicEventsPage] list_public_events_with_progress failed", {
         code: error.code,

[Survived] BlockStatement
lib/actions/events.ts:332:16
   );
 
   if (error || !data) {
-    if (error) {
-      console.error("[getPublicEventsPage] list_public_events_with_progress failed", {
-        code: error.code,
-        message: error.message,
-        details: error.details ?? null,
-        hint: error.hint ?? null,
-      });
-    }
+    if (error) {}
     return { events: [], hasMore: false, nextCursor: null };
   }

[Killed] BooleanLiteral
lib/actions/events.ts:340:35
         hint: error.hint ?? null,
       });
     }
-    return { events: [], hasMore: false, nextCursor: null };
+    return { events: [], hasMore: true, nextCursor: null };
   }
 
killedBy: getPublicEventsPage/getPublicEvents returns empty results when rpc fails
statusReason: expected { events: [], hasMore: true, …(1) } to deeply equal { events: [], hasMore: false, …(1) }

[Killed] ArrowFunction
lib/actions/events.ts:343:58
     return { events: [], hasMore: false, nextCursor: null };
   }
 
-  const mapped = (data as PublicEventWithProgress[]).map((event) => ({
-    ...event,
-    claimed: Number(event.claimed ?? 0),
-    total: Number(event.total ?? 30),
-  }));
+  const mapped = (data as PublicEventWithProgress[]).map(() => undefined);
 
   const hasMore = mapped.length > normalizedLimit;
killedBy: getPublicEventsPage/getPublicEvents includes cursor params and computes hasMore + nextCursor
statusReason: expected { …(3) } to deeply equal { events: [ …(2) ], …(2) }

[Killed] ObjectLiteral
lib/actions/events.ts:343:70
     return { events: [], hasMore: false, nextCursor: null };
   }
 
-  const mapped = (data as PublicEventWithProgress[]).map((event) => ({
-    ...event,
-    claimed: Number(event.claimed ?? 0),
-    total: Number(event.total ?? 30),
-  }));
+  const mapped = (data as PublicEventWithProgress[]).map((event) => ({}));
 
   const hasMore = mapped.length > normalizedLimit;
killedBy: getPublicEventsPage/getPublicEvents includes cursor params and computes hasMore + nextCursor
statusReason: expected { events: [ {}, {} ], …(2) } to deeply equal { events: [ …(2) ], …(2) }

[Killed] LogicalOperator
lib/actions/events.ts:345:21
 
   const mapped = (data as PublicEventWithProgress[]).map((event) => ({
     ...event,
-    claimed: Number(event.claimed ?? 0),
+    claimed: Number(event.claimed && 0),
     total: Number(event.total ?? 30),
   }));
killedBy: getPublicEventsPage/getPublicEvents includes cursor params and computes hasMore + nextCursor
statusReason: expected { Object (events, hasMore, ...) } to deeply equal { events: [ …(2) ], …(2) }

[Killed] LogicalOperator
lib/actions/events.ts:346:19
   const mapped = (data as PublicEventWithProgress[]).map((event) => ({
     ...event,
     claimed: Number(event.claimed ?? 0),
-    total: Number(event.total ?? 30),
+    total: Number(event.total && 30),
   }));
 
killedBy: getPublicEventsPage/getPublicEvents includes cursor params and computes hasMore + nextCursor
statusReason: expected { Object (events, hasMore, ...) } to deeply equal { events: [ …(2) ], …(2) }

[Killed] ConditionalExpression
lib/actions/events.ts:349:19
     total: Number(event.total ?? 30),
   }));
 
-  const hasMore = mapped.length > normalizedLimit;
+  const hasMore = false;
   const events = hasMore ? mapped.slice(0, normalizedLimit) : mapped;
   const lastEvent = hasMore ? events[events.length - 1] : null;
killedBy: getPublicEventsPage/getPublicEvents includes cursor params and computes hasMore + nextCursor
statusReason: expected { events: [ { …(9) }, …(2) ], …(2) } to deeply equal { events: [ …(2) ], …(2) }

[Killed] EqualityOperator
lib/actions/events.ts:349:19
     total: Number(event.total ?? 30),
   }));
 
-  const hasMore = mapped.length > normalizedLimit;
+  const hasMore = mapped.length <= normalizedLimit;
   const events = hasMore ? mapped.slice(0, normalizedLimit) : mapped;
   const lastEvent = hasMore ? events[events.length - 1] : null;
killedBy: getPublicEventsPage/getPublicEvents includes cursor params and computes hasMore + nextCursor
statusReason: expected { events: [ { …(9) }, …(2) ], …(2) } to deeply equal { events: [ …(2) ], …(2) }

[Killed] MethodExpression
lib/actions/events.ts:350:28
   }));
 
   const hasMore = mapped.length > normalizedLimit;
-  const events = hasMore ? mapped.slice(0, normalizedLimit) : mapped;
+  const events = hasMore ? mapped : mapped;
   const lastEvent = hasMore ? events[events.length - 1] : null;
 
killedBy: getPublicEventsPage/getPublicEvents includes cursor params and computes hasMore + nextCursor
statusReason: expected { events: [ { …(9) }, …(2) ], …(2) } to deeply equal { events: [ …(2) ], …(2) }

[Killed] ArithmeticOperator
lib/actions/events.ts:351:38
 
   const hasMore = mapped.length > normalizedLimit;
   const events = hasMore ? mapped.slice(0, normalizedLimit) : mapped;
-  const lastEvent = hasMore ? events[events.length - 1] : null;
+  const lastEvent = hasMore ? events[events.length + 1] : null;
 
   return {
killedBy: getPublicEventsPage/getPublicEvents includes cursor params and computes hasMore + nextCursor
statusReason: expected { Object (events, hasMore, ...) } to deeply equal { events: [ …(2) ], …(2) }

[Killed] ConditionalExpression
lib/actions/events.ts:357:7
     events,
     hasMore,
     nextCursor:
-      hasMore && lastEvent
+      true
         ? { createdAt: lastEvent.created_at, id: lastEvent.id }
         : null,
killedBy: getPublicEventsPage/getPublicEvents uses default pagination args for invalid limit
statusReason: Cannot read properties of null (reading 'created_at')

[Killed] ConditionalExpression
lib/actions/events.ts:357:7
     events,
     hasMore,
     nextCursor:
-      hasMore && lastEvent
+      false
         ? { createdAt: lastEvent.created_at, id: lastEvent.id }
         : null,
killedBy: getPublicEventsPage/getPublicEvents includes cursor params and computes hasMore + nextCursor
statusReason: expected { Object (events, hasMore, ...) } to deeply equal { events: [ …(2) ], …(2) }

[Killed] BlockStatement
lib/actions/events.ts:363:87
   };
 }
 
-export async function getPublicEvents(limit = 50): Promise<PublicEventWithProgress[]> {
-  const page = await getPublicEventsPage({ limit });
-  return page.events;
-}
+export async function getPublicEvents(limit = 50): Promise<PublicEventWithProgress[]> {}
 
 export async function getUserEvents() {
killedBy: getPublicEventsPage/getPublicEvents getPublicEvents returns events from the first page
statusReason: expected undefined to deeply equal [ ObjectContaining{…} ]

[Killed] ObjectLiteral
lib/actions/events.ts:364:42
 }
 
 export async function getPublicEvents(limit = 50): Promise<PublicEventWithProgress[]> {
-  const page = await getPublicEventsPage({ limit });
+  const page = await getPublicEventsPage({});
   return page.events;
 }
killedBy: getPublicEventsPage/getPublicEvents getPublicEvents returns events from the first page
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received: 

  1st vi.fn() call:

  [
    "list_public_events_with_progress",

[Killed] ConditionalExpression
lib/actions/events.ts:375:7
     error: userError,
   } = await supabase.auth.getUser();
 
-  if (userError) {
+  if (true) {
     console.error("[getUserEvents] auth.getUser failed", {
       code: userError.code,
killedBy: getUserEvents returns empty list for no user or anonymous user
statusReason: Cannot read properties of null (reading 'code')

[Survived] ConditionalExpression
lib/actions/events.ts:375:7
     error: userError,
   } = await supabase.auth.getUser();
 
-  if (userError) {
+  if (false) {
     console.error("[getUserEvents] auth.getUser failed", {
       code: userError.code,

[Killed] ConditionalExpression
lib/actions/events.ts:383:7
     return [];
   }
 
-  if (!user || isAnonymousUser(user)) return [];
+  if (false) return [];
 
   const { data, error } = await supabase.rpc("list_user_events_with_progress");
killedBy: getUserEvents returns empty list for no user or anonymous user
statusReason: Cannot destructure property 'data' of '(intermediate value)' as it is undefined.

[Killed] LogicalOperator
lib/actions/events.ts:383:7
     return [];
   }
 
-  if (!user || isAnonymousUser(user)) return [];
+  if (!user && isAnonymousUser(user)) return [];
 
   const { data, error } = await supabase.rpc("list_user_events_with_progress");
killedBy: getUserEvents returns empty list for no user or anonymous user
statusReason: Cannot destructure property 'data' of '(intermediate value)' as it is undefined.

[Killed] StringLiteral
lib/actions/events.ts:385:46
 
   if (!user || isAnonymousUser(user)) return [];
 
-  const { data, error } = await supabase.rpc("list_user_events_with_progress");
+  const { data, error } = await supabase.rpc("");
 
   if (error) {
killedBy: getUserEvents returns empty list when list_user_events_with_progress fails
statusReason: expected "vi.fn()" to be called with arguments: [ 'list_user_events_with_progress' ]

Received: 

  1st vi.fn() call:

  [
-   "list_user_events_with_progress",

[Survived] BlockStatement
lib/actions/events.ts:387:14
 
   const { data, error } = await supabase.rpc("list_user_events_with_progress");
 
-  if (error) {
-    logUserEventsError("list_user_events_with_progress", error, {
-      userId: user.id,
-    });
-    return [];
-  }
+  if (error) {}
 
   if (!data) return [];

[Survived] StringLiteral
lib/actions/events.ts:388:24
   const { data, error } = await supabase.rpc("list_user_events_with_progress");
 
   if (error) {
-    logUserEventsError("list_user_events_with_progress", error, {
+    logUserEventsError("", error, {
       userId: user.id,
     });

[Killed] ArrayDeclaration
lib/actions/events.ts:391:12
     logUserEventsError("list_user_events_with_progress", error, {
       userId: user.id,
     });
-    return [];
+    return ["Stryker was here"];
   }
 
killedBy: getUserEvents returns empty list when list_user_events_with_progress fails
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] ConditionalExpression
lib/actions/events.ts:394:7
     return [];
   }
 
-  if (!data) return [];
+  if (true) return [];
 
   return (
killedBy: getUserEvents maps numeric fields when rpc succeeds
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] BooleanLiteral
lib/actions/events.ts:394:7
     return [];
   }
 
-  if (!data) return [];
+  if (data) return [];
 
   return (
killedBy: getUserEvents maps numeric fields when rpc succeeds
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] ArrowFunction
lib/actions/events.ts:409:9
       claimed: number;
       total: number;
     }>
-  ).map((event) => ({
-    ...event,
-    claimed: Number(event.claimed ?? 0),
-    total: Number(event.total ?? 30),
-  }));
+  ).map(() => undefined);
 }
 
killedBy: getUserEvents maps numeric fields when rpc succeeds
statusReason: expected [ undefined ] to deeply equal [ ObjectContaining{…} ]

[NoCoverage] StringLiteral
lib/actions/events.ts:424:19
   } = await supabase.auth.getUser();
 
   if (userError) {
-    console.error("[getMyCircles] auth.getUser failed", {
+    console.error("", {
       code: userError.code,
       message: userError.message,

[Killed] ConditionalExpression
lib/actions/events.ts:431:7
     return [];
   }
 
-  if (!user) return [];
+  if (false) return [];
 
   const { data, error } = await supabase.rpc("list_my_circles_with_progress");
killedBy: getMyCircles returns empty list when there is no active user
statusReason: supabase.rpc is not a function

[Killed] ConditionalExpression
lib/actions/events.ts:431:7
     return [];
   }
 
-  if (!user) return [];
+  if (true) return [];
 
   const { data, error } = await supabase.rpc("list_my_circles_with_progress");
killedBy: getMyCircles returns empty list when RPC fails
statusReason: expected "vi.fn()" to be called with arguments: [ 'list_my_circles_with_progress' ]

Number of calls: 0

[Killed] StringLiteral
lib/actions/events.ts:433:46
 
   if (!user) return [];
 
-  const { data, error } = await supabase.rpc("list_my_circles_with_progress");
+  const { data, error } = await supabase.rpc("");
 
   if (error) {
killedBy: getMyCircles returns empty list when RPC fails
statusReason: expected "vi.fn()" to be called with arguments: [ 'list_my_circles_with_progress' ]

Received: 

  1st vi.fn() call:

  [
-   "list_my_circles_with_progress",

[Survived] StringLiteral
lib/actions/events.ts:436:24
   const { data, error } = await supabase.rpc("list_my_circles_with_progress");
 
   if (error) {
-    logUserEventsError("list_my_circles_with_progress", error, {
+    logUserEventsError("", error, {
       userId: user.id,
       isAnonymous: isAnonymousUser(user),

[Killed] ArrowFunction
lib/actions/events.ts:462:9
       my_read: number;
       last_activity_at: string;
     }>
-  ).map((circle) => ({
-    ...circle,
-    relation: circle.relation === "creator" ? "creator" : "participant",
-    claimed: Number(circle.claimed ?? 0),
-    total: Number(circle.total ?? 30),
-    my_claimed: Number(circle.my_claimed ?? 0),
-    my_read: Number(circle.my_read ?? 0),
-    last_activity_at: circle.last_activity_at ?? circle.created_at,
-  }));
+  ).map(() => undefined);
 }
 
killedBy: getMyCircles maps numeric fields and relation safely
statusReason: expected [ undefined, undefined ] to deeply equal [ { id: 'circle-1', …(13) }, …(1) ]

[Killed] EqualityOperator
lib/actions/events.ts:464:15
     }>
   ).map((circle) => ({
     ...circle,
-    relation: circle.relation === "creator" ? "creator" : "participant",
+    relation: circle.relation !== "creator" ? "creator" : "participant",
     claimed: Number(circle.claimed ?? 0),
     total: Number(circle.total ?? 30),
killedBy: getMyCircles maps numeric fields and relation safely
statusReason: expected [ { id: 'circle-1', …(13) }, …(1) ] to deeply equal [ { id: 'circle-1', …(13) }, …(1) ]

[Killed] ConditionalExpression
lib/actions/events.ts:464:15
     }>
   ).map((circle) => ({
     ...circle,
-    relation: circle.relation === "creator" ? "creator" : "participant",
+    relation: false ? "creator" : "participant",
     claimed: Number(circle.claimed ?? 0),
     total: Number(circle.total ?? 30),
killedBy: getMyCircles maps numeric fields and relation safely
statusReason: expected [ { id: 'circle-1', …(13) }, …(1) ] to deeply equal [ { id: 'circle-1', …(13) }, …(1) ]

[Killed] LogicalOperator
lib/actions/events.ts:465:21
   ).map((circle) => ({
     ...circle,
     relation: circle.relation === "creator" ? "creator" : "participant",
-    claimed: Number(circle.claimed ?? 0),
+    claimed: Number(circle.claimed && 0),
     total: Number(circle.total ?? 30),
     my_claimed: Number(circle.my_claimed ?? 0),
killedBy: getMyCircles maps numeric fields and relation safely
statusReason: expected [ { id: 'circle-1', …(13) }, …(1) ] to deeply equal [ { id: 'circle-1', …(13) }, …(1) ]

[Killed] LogicalOperator
lib/actions/events.ts:466:19
     ...circle,
     relation: circle.relation === "creator" ? "creator" : "participant",
     claimed: Number(circle.claimed ?? 0),
-    total: Number(circle.total ?? 30),
+    total: Number(circle.total && 30),
     my_claimed: Number(circle.my_claimed ?? 0),
     my_read: Number(circle.my_read ?? 0),
killedBy: getMyCircles maps numeric fields and relation safely
statusReason: expected [ { id: 'circle-1', …(13) }, …(1) ] to deeply equal [ { id: 'circle-1', …(13) }, …(1) ]

[Killed] LogicalOperator
lib/actions/events.ts:467:24
     relation: circle.relation === "creator" ? "creator" : "participant",
     claimed: Number(circle.claimed ?? 0),
     total: Number(circle.total ?? 30),
-    my_claimed: Number(circle.my_claimed ?? 0),
+    my_claimed: Number(circle.my_claimed && 0),
     my_read: Number(circle.my_read ?? 0),
     last_activity_at: circle.last_activity_at ?? circle.created_at,
killedBy: getMyCircles maps numeric fields and relation safely
statusReason: expected [ { id: 'circle-1', …(13) }, …(1) ] to deeply equal [ { id: 'circle-1', …(13) }, …(1) ]

[Killed] LogicalOperator
lib/actions/events.ts:468:21
     claimed: Number(circle.claimed ?? 0),
     total: Number(circle.total ?? 30),
     my_claimed: Number(circle.my_claimed ?? 0),
-    my_read: Number(circle.my_read ?? 0),
+    my_read: Number(circle.my_read && 0),
     last_activity_at: circle.last_activity_at ?? circle.created_at,
   }));
killedBy: getMyCircles maps numeric fields and relation safely
statusReason: expected [ { id: 'circle-1', …(13) }, …(1) ] to deeply equal [ { id: 'circle-1', …(13) }, …(1) ]

[Killed] LogicalOperator
lib/actions/events.ts:469:23
     total: Number(circle.total ?? 30),
     my_claimed: Number(circle.my_claimed ?? 0),
     my_read: Number(circle.my_read ?? 0),
-    last_activity_at: circle.last_activity_at ?? circle.created_at,
+    last_activity_at: circle.last_activity_at && circle.created_at,
   }));
 }
killedBy: getMyCircles maps numeric fields and relation safely
statusReason: expected [ { id: 'circle-1', …(13) }, …(1) ] to deeply equal [ { id: 'circle-1', …(13) }, …(1) ]

[Killed] BlockStatement
lib/actions/events.ts:477:3
   shortCode: string,
   rpcName: "set_event_archive" | "delete_event_by_shortcode",
   args: Record<string, unknown> = {}
-) {
-  if (!shortCodeSchema.safeParse(shortCode).success) return { error: "Invalid input" };
-
-  const supabase = await createClient();
-  const { error } = await supabase.rpc(rpcName, {
-    p_short_code: shortCode,
-    ...args,
-  });
-
-  if (error) {
-    return { error: error.message || "Request failed" };
-  }
-
-  return {};
-}
+) {}
 
 export async function archiveEvent(shortCode: string) {
killedBy: event mutation actions rejects invalid short codes before calling supabase
statusReason: Cannot read properties of undefined (reading 'error')

[Killed] BooleanLiteral
lib/actions/events.ts:478:7
   rpcName: "set_event_archive" | "delete_event_by_shortcode",
   args: Record<string, unknown> = {}
 ) {
-  if (!shortCodeSchema.safeParse(shortCode).success) return { error: "Invalid input" };
+  if (shortCodeSchema.safeParse(shortCode).success) return { error: "Invalid input" };
 
   const supabase = await createClient();
killedBy: event mutation actions rejects invalid short codes before calling supabase
statusReason: Cannot read properties of undefined (reading 'rpc')

[Killed] ConditionalExpression
lib/actions/events.ts:478:7
   rpcName: "set_event_archive" | "delete_event_by_shortcode",
   args: Record<string, unknown> = {}
 ) {
-  if (!shortCodeSchema.safeParse(shortCode).success) return { error: "Invalid input" };
+  if (true) return { error: "Invalid input" };
 
   const supabase = await createClient();
killedBy: event mutation actions returns rpc errors for archiveEvent
statusReason: expected { error: 'Invalid input' } to deeply equal { error: 'archive failed' }

[Killed] ObjectLiteral
lib/actions/events.ts:481:49
   if (!shortCodeSchema.safeParse(shortCode).success) return { error: "Invalid input" };
 
   const supabase = await createClient();
-  const { error } = await supabase.rpc(rpcName, {
-    p_short_code: shortCode,
-    ...args,
-  });
+  const { error } = await supabase.rpc(rpcName, {});
 
   if (error) {
killedBy: event mutation actions returns rpc errors for archiveEvent
statusReason: expected "vi.fn()" to be called with arguments: [ 'set_event_archive', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "set_event_archive",

[Killed] BlockStatement
lib/actions/events.ts:486:14
     ...args,
   });
 
-  if (error) {
-    return { error: error.message || "Request failed" };
-  }
+  if (error) {}
 
   return {};
killedBy: event mutation actions returns rpc errors for archiveEvent
statusReason: expected {} to deeply equal { error: 'archive failed' }

[Killed] ConditionalExpression
lib/actions/events.ts:487:21
   });
 
   if (error) {
-    return { error: error.message || "Request failed" };
+    return { error: false };
   }
 
killedBy: event mutation actions returns rpc errors for archiveEvent
statusReason: expected {} to deeply equal { error: 'archive failed' }

[Killed] LogicalOperator
lib/actions/events.ts:487:21
   });
 
   if (error) {
-    return { error: error.message || "Request failed" };
+    return { error: error.message && "Request failed" };
   }
 
killedBy: event mutation actions returns rpc errors for archiveEvent
statusReason: expected { error: 'Request failed' } to deeply equal { error: 'archive failed' }
