[Killed] BlockStatement
hooks/use-auth.tsx:47:57
 
 export const AuthContext = createContext<AuthContextType | null>(null);
 
-function isAnonymousUser(user: User | null | undefined) {
-  return Boolean(user?.is_anonymous);
-}
+function isAnonymousUser(user: User | null | undefined) {}
 
 function wait(ms: number) {
killedBy: useAuth returns MergePreparationError when merge prep endpoint fails
statusReason: expected undefined to be 'MergePreparationError' // Object.is equality

[Killed] OptionalChaining
hooks/use-auth.tsx:48:18
 export const AuthContext = createContext<AuthContextType | null>(null);
 
 function isAnonymousUser(user: User | null | undefined) {
-  return Boolean(user?.is_anonymous);
+  return Boolean(user.is_anonymous);
 }
 
killedBy: useAuth bootstraps anonymous session through ensureSession
statusReason: Cannot read properties of null (reading 'is_anonymous')

[Timeout] BlockStatement
hooks/use-auth.tsx:51:27
   return Boolean(user?.is_anonymous);
 }
 
-function wait(ms: number) {
-  return new Promise((resolve) => setTimeout(resolve, ms));
-}
+function wait(ms: number) {}
 
 function buildMergePreparationError() {

[Killed] ArrowFunction
hooks/use-auth.tsx:52:22
 }
 
 function wait(ms: number) {
-  return new Promise((resolve) => setTimeout(resolve, ms));
+  return new Promise(() => undefined);
 }
 
killedBy: useAuth retries merge finalization after pending_auth auth-state callback
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] BlockStatement
hooks/use-auth.tsx:55:39
   return new Promise((resolve) => setTimeout(resolve, ms));
 }
 
-function buildMergePreparationError() {
-  const error = new Error(MERGE_PREPARATION_BLOCK_MESSAGE);
-  error.name = "MergePreparationError";
-  return error;
-}
+function buildMergePreparationError() {}
 
 export function AuthProvider({ children }: { children: ReactNode }) {
killedBy: useAuth returns MergePreparationError when merge prep endpoint fails
statusReason: expected undefined to be 'MergePreparationError' // Object.is equality

[Survived] BooleanLiteral
hooks/use-auth.tsx:63:46
 
 export function AuthProvider({ children }: { children: ReactNode }) {
   const [user, setUser] = useState<User | null>(null);
-  const [isLoading, setIsLoading] = useState(true);
+  const [isLoading, setIsLoading] = useState(false);
   const [sessionReady, setSessionReady] = useState(false);
   const [supabase] = useState(() => createClient());

[Survived] BooleanLiteral
hooks/use-auth.tsx:64:52
 export function AuthProvider({ children }: { children: ReactNode }) {
   const [user, setUser] = useState<User | null>(null);
   const [isLoading, setIsLoading] = useState(true);
-  const [sessionReady, setSessionReady] = useState(false);
+  const [sessionReady, setSessionReady] = useState(true);
   const [supabase] = useState(() => createClient());
   const ensureSessionRef = useRef<Promise<User | null> | null>(null);

[Killed] ArrowFunction
hooks/use-auth.tsx:65:31
   const [user, setUser] = useState<User | null>(null);
   const [isLoading, setIsLoading] = useState(true);
   const [sessionReady, setSessionReady] = useState(false);
-  const [supabase] = useState(() => createClient());
+  const [supabase] = useState(() => undefined);
   const ensureSessionRef = useRef<Promise<User | null> | null>(null);
   const finalizeMergeRef = useRef<Promise<MergeFinalizeStatus | null> | null>(null);
killedBy: useAuth bootstraps anonymous session through ensureSession
statusReason: Cannot read properties of undefined (reading 'auth')

[Killed] BlockStatement
hooks/use-auth.tsx:69:74
   const ensureSessionRef = useRef<Promise<User | null> | null>(null);
   const finalizeMergeRef = useRef<Promise<MergeFinalizeStatus | null> | null>(null);
 
-  const emitMergeComplete = useCallback((status: MergeFinalizeStatus) => {
-    if (typeof window === "undefined") return;
-    if (status === "no_pending_merge") return;
-
-    window.dispatchEvent(
-      new CustomEvent(MERGE_COMPLETE_EVENT, {
-        detail: { status },
-      })
-    );
-  }, []);
+  const emitMergeComplete = useCallback((status: MergeFinalizeStatus) => {}, []);
 
   const prepareAnonymousMergeState = useCallback(async (): Promise<boolean> => {
killedBy: useAuth retries merge finalization after pending_auth auth-state callback
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] EqualityOperator
hooks/use-auth.tsx:70:9
   const finalizeMergeRef = useRef<Promise<MergeFinalizeStatus | null> | null>(null);
 
   const emitMergeComplete = useCallback((status: MergeFinalizeStatus) => {
-    if (typeof window === "undefined") return;
+    if (typeof window !== "undefined") return;
     if (status === "no_pending_merge") return;
 
killedBy: useAuth retries merge finalization after pending_auth auth-state callback
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
hooks/use-auth.tsx:70:9
   const finalizeMergeRef = useRef<Promise<MergeFinalizeStatus | null> | null>(null);
 
   const emitMergeComplete = useCallback((status: MergeFinalizeStatus) => {
-    if (typeof window === "undefined") return;
+    if (true) return;
     if (status === "no_pending_merge") return;
 
killedBy: useAuth retries merge finalization after pending_auth auth-state callback
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
hooks/use-auth.tsx:71:9
 
   const emitMergeComplete = useCallback((status: MergeFinalizeStatus) => {
     if (typeof window === "undefined") return;
-    if (status === "no_pending_merge") return;
+    if (false) return;
 
     window.dispatchEvent(
killedBy: useAuth does not emit merge event for no_pending_merge status
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      CustomEvent {

[Killed] EqualityOperator
hooks/use-auth.tsx:71:9
 
   const emitMergeComplete = useCallback((status: MergeFinalizeStatus) => {
     if (typeof window === "undefined") return;
-    if (status === "no_pending_merge") return;
+    if (status !== "no_pending_merge") return;
 
     window.dispatchEvent(
killedBy: useAuth retries merge finalization after pending_auth auth-state callback
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
hooks/use-auth.tsx:85:9
       data: { user: currentUser },
     } = await supabase.auth.getUser();
 
-    if (!currentUser || !isAnonymousUser(currentUser)) {
+    if (true) {
       return true;
     }
killedBy: useAuth returns MergePreparationError when merge prep endpoint fails
statusReason: expected undefined to be 'MergePreparationError' // Object.is equality

[Killed] BooleanLiteral
hooks/use-auth.tsx:85:25
       data: { user: currentUser },
     } = await supabase.auth.getUser();
 
-    if (!currentUser || !isAnonymousUser(currentUser)) {
+    if (!currentUser || isAnonymousUser(currentUser)) {
       return true;
     }
killedBy: useAuth returns MergePreparationError when merge prep endpoint fails
statusReason: expected undefined to be 'MergePreparationError' // Object.is equality

[Killed] BooleanLiteral
hooks/use-auth.tsx:86:14
     } = await supabase.auth.getUser();
 
     if (!currentUser || !isAnonymousUser(currentUser)) {
-      return true;
+      return false;
     }
 
killedBy: useAuth skips merge prep when user is not anonymous
statusReason: expected MergePreparationError: Could not secure c… to be null

[Killed] EqualityOperator
hooks/use-auth.tsx:89:27
       return true;
     }
 
-    for (let attempt = 0; attempt < 5; attempt++) {
+    for (let attempt = 0; attempt >= 5; attempt++) {
       try {
         const response = await fetch("/api/auth/prepare-merge", {
killedBy: useAuth returns MergePreparationError when merge prep endpoint fails
statusReason: expected "vi.fn()" to be called with arguments: [ '/api/auth/prepare-merge', …(1) ]

Number of calls: 0

[Killed] ConditionalExpression
hooks/use-auth.tsx:89:27
       return true;
     }
 
-    for (let attempt = 0; attempt < 5; attempt++) {
+    for (let attempt = 0; false; attempt++) {
       try {
         const response = await fetch("/api/auth/prepare-merge", {
killedBy: useAuth returns MergePreparationError when merge prep endpoint fails
statusReason: expected "vi.fn()" to be called with arguments: [ '/api/auth/prepare-merge', …(1) ]

Number of calls: 0

[Killed] StringLiteral
hooks/use-auth.tsx:93:24
       try {
         const response = await fetch("/api/auth/prepare-merge", {
           method: "POST",
-          credentials: "include",
+          credentials: "",
           cache: "no-store",
         });
killedBy: useAuth returns MergePreparationError when merge prep endpoint fails
statusReason: expected "vi.fn()" to be called with arguments: [ '/api/auth/prepare-merge', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "/api/auth/prepare-merge",

[Killed] BooleanLiteral
hooks/use-auth.tsx:96:13
           credentials: "include",
           cache: "no-store",
         });
-        if (!response.ok) {
+        if (response.ok) {
           console.error("[auth] prepare merge state failed:", response.status);
           return false;
killedBy: useAuth signInWithPassword finalizes merge state for authenticated sessions
statusReason: expected MergePreparationError: Could not secure c… to be null

[Killed] BooleanLiteral
hooks/use-auth.tsx:98:18
         });
         if (!response.ok) {
           console.error("[auth] prepare merge state failed:", response.status);
-          return false;
+          return true;
         }
 
killedBy: useAuth returns MergePreparationError when merge prep endpoint fails
statusReason: expected undefined to be 'MergePreparationError' // Object.is equality

[Killed] BlockStatement
hooks/use-auth.tsx:105:31
           prepared?: boolean;
           reason?: string;
         };
-        if (payload.prepared) {
-          return true;
-        }
+        if (payload.prepared) {}
 
         if (process.env.NODE_ENV !== "production") {
killedBy: useAuth signInWithPassword finalizes merge state for authenticated sessions
statusReason: expected MergePreparationError: Could not secure c… to be null

[Killed] ConditionalExpression
hooks/use-auth.tsx:105:13
           prepared?: boolean;
           reason?: string;
         };
-        if (payload.prepared) {
+        if (false) {
           return true;
         }
killedBy: useAuth signInWithPassword finalizes merge state for authenticated sessions
statusReason: expected MergePreparationError: Could not secure c… to be null

[Killed] BooleanLiteral
hooks/use-auth.tsx:106:18
           reason?: string;
         };
         if (payload.prepared) {
-          return true;
+          return false;
         }
 
killedBy: useAuth signInWithPassword finalizes merge state for authenticated sessions
statusReason: expected MergePreparationError: Could not secure c… to be null

[NoCoverage] EqualityOperator
hooks/use-auth.tsx:109:13
           return true;
         }
 
-        if (process.env.NODE_ENV !== "production") {
+        if (process.env.NODE_ENV === "production") {
           console.warn(
             "[auth] merge state not prepared yet",

[NoCoverage] BlockStatement
hooks/use-auth.tsx:109:52
           return true;
         }
 
-        if (process.env.NODE_ENV !== "production") {
-          console.warn(
-            "[auth] merge state not prepared yet",
-            payload.reason ?? "unknown_reason",
-            `(attempt ${attempt + 1}/5)`
-          );
-        }
+        if (process.env.NODE_ENV !== "production") {}
       } catch (error) {
         console.error("[auth] prepare merge state failed:", error);

[NoCoverage] LogicalOperator
hooks/use-auth.tsx:112:13
         if (process.env.NODE_ENV !== "production") {
           console.warn(
             "[auth] merge state not prepared yet",
-            payload.reason ?? "unknown_reason",
+            payload.reason && "unknown_reason",
             `(attempt ${attempt + 1}/5)`
           );

[NoCoverage] ArithmeticOperator
hooks/use-auth.tsx:113:25
           console.warn(
             "[auth] merge state not prepared yet",
             payload.reason ?? "unknown_reason",
-            `(attempt ${attempt + 1}/5)`
+            `(attempt ${attempt - 1}/5)`
           );
         }

[Killed] BlockStatement
hooks/use-auth.tsx:116:23
             `(attempt ${attempt + 1}/5)`
           );
         }
-      } catch (error) {
-        console.error("[auth] prepare merge state failed:", error);
-        return false;
-      }
+      } catch (error) {}
 
       await wait(Math.min(250 * 2 ** attempt, 2000));
killedBy: useAuth returns MergePreparationError when prepare-merge fetch throws
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
hooks/use-auth.tsx:118:16
         }
       } catch (error) {
         console.error("[auth] prepare merge state failed:", error);
-        return false;
+        return true;
       }
 
killedBy: useAuth returns MergePreparationError when prepare-merge fetch throws
statusReason: expected undefined to be 'MergePreparationError' // Object.is equality

[NoCoverage] MethodExpression
hooks/use-auth.tsx:121:18
         return false;
       }
 
-      await wait(Math.min(250 * 2 ** attempt, 2000));
+      await wait(Math.max(250 * 2 ** attempt, 2000));
     }
 

[NoCoverage] ArithmeticOperator
hooks/use-auth.tsx:121:27
         return false;
       }
 
-      await wait(Math.min(250 * 2 ** attempt, 2000));
+      await wait(Math.min(250 / 2 ** attempt, 2000));
     }
 

[NoCoverage] BooleanLiteral
hooks/use-auth.tsx:125:12
     }
 
     console.warn("[auth] merge state cookie was not prepared.");
-    return false;
+    return true;
   }, [supabase]);
 

[Killed] ConditionalExpression
hooks/use-auth.tsx:129:9
   }, [supabase]);
 
   const finalizeAnonymousMergeState = useCallback(async () => {
-    if (finalizeMergeRef.current) {
+    if (true) {
       return finalizeMergeRef.current;
     }
killedBy: useAuth signInWithPassword finalizes merge state for authenticated sessions
statusReason: expected 2nd "vi.fn()" call to have been called with [ '/auth/callback', …(1) ], but called only 1 times

[Survived] ConditionalExpression
hooks/use-auth.tsx:129:9
   }, [supabase]);
 
   const finalizeAnonymousMergeState = useCallback(async () => {
-    if (finalizeMergeRef.current) {
+    if (false) {
       return finalizeMergeRef.current;
     }

[Killed] EqualityOperator
hooks/use-auth.tsx:138:14
       let attempt = 0;
       let lastStatus: MergeFinalizeStatus | null = null;
 
-      while (Date.now() - start < MERGE_RETRY_WINDOW_MS) {
+      while (Date.now() - start >= MERGE_RETRY_WINDOW_MS) {
         attempt++;
         try {
killedBy: useAuth signInWithPassword finalizes merge state for authenticated sessions
statusReason: expected 2nd "vi.fn()" call to have been called with [ '/auth/callback', …(1) ], but called only 1 times

[Killed] ConditionalExpression
hooks/use-auth.tsx:138:14
       let attempt = 0;
       let lastStatus: MergeFinalizeStatus | null = null;
 
-      while (Date.now() - start < MERGE_RETRY_WINDOW_MS) {
+      while (false) {
         attempt++;
         try {
killedBy: useAuth signInWithPassword finalizes merge state for authenticated sessions
statusReason: expected 2nd "vi.fn()" call to have been called with [ '/auth/callback', …(1) ], but called only 1 times

[Survived] UpdateOperator
hooks/use-auth.tsx:139:9
       let lastStatus: MergeFinalizeStatus | null = null;
 
       while (Date.now() - start < MERGE_RETRY_WINDOW_MS) {
-        attempt++;
+        attempt--;
         try {
           const response = await fetch("/auth/callback", {

[Killed] MethodExpression
hooks/use-auth.tsx:149:24
           if (!response.ok) {
             console.error("[auth] finalize merge state failed:", response.status);
             lastStatus = "merge_retryable_error";
-            await wait(Math.min(300 * 2 ** (attempt - 1), 3000));
+            await wait(Math.max(300 * 2 ** (attempt - 1), 3000));
             continue;
           }
killedBy: useAuth retries finalize when fetch returns non-ok and eventually succeeds
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] ArithmeticOperator
hooks/use-auth.tsx:149:45
           if (!response.ok) {
             console.error("[auth] finalize merge state failed:", response.status);
             lastStatus = "merge_retryable_error";
-            await wait(Math.min(300 * 2 ** (attempt - 1), 3000));
+            await wait(Math.min(300 * 2 ** (attempt + 1), 3000));
             continue;
           }
killedBy: useAuth retries finalize when fetch returns non-ok and eventually succeeds
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] BlockStatement
hooks/use-auth.tsx:154:32
           }
 
           const payload = (await response.json()) as { status?: MergeFinalizeStatus };
-          if (!payload.status) {
-            console.warn("[auth] finalize merge state response missing status");
-            lastStatus = "merge_retryable_error";
-            await wait(Math.min(300 * 2 ** (attempt - 1), 3000));
-            continue;
-          }
+          if (!payload.status) {}
 
           lastStatus = payload.status;
killedBy: useAuth retries finalize when response is missing status field
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] ConditionalExpression
hooks/use-auth.tsx:154:15
           }
 
           const payload = (await response.json()) as { status?: MergeFinalizeStatus };
-          if (!payload.status) {
+          if (false) {
             console.warn("[auth] finalize merge state response missing status");
             lastStatus = "merge_retryable_error";
killedBy: useAuth retries finalize when response is missing status field
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] EqualityOperator
hooks/use-auth.tsx:163:13
 
           lastStatus = payload.status;
           if (
-            payload.status !== "pending_auth" &&
+            payload.status === "pending_auth" &&
             payload.status !== "merge_retryable_error"
           ) {
killedBy: useAuth signInWithPassword finalizes merge state for authenticated sessions
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] LogicalOperator
hooks/use-auth.tsx:163:13
 
           lastStatus = payload.status;
           if (
-            payload.status !== "pending_auth" &&
-            payload.status !== "merge_retryable_error"
+            payload.status !== "pending_auth" || payload.status !== "merge_retryable_error"
           ) {
             emitMergeComplete(payload.status);
killedBy: useAuth retries merge finalization after pending_auth auth-state callback
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] EqualityOperator
hooks/use-auth.tsx:164:13
           lastStatus = payload.status;
           if (
             payload.status !== "pending_auth" &&
-            payload.status !== "merge_retryable_error"
+            payload.status === "merge_retryable_error"
           ) {
             emitMergeComplete(payload.status);
killedBy: useAuth signInWithPassword finalizes merge state for authenticated sessions
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
hooks/use-auth.tsx:164:13
           lastStatus = payload.status;
           if (
             payload.status !== "pending_auth" &&
-            payload.status !== "merge_retryable_error"
+            true
           ) {
             emitMergeComplete(payload.status);
killedBy: useAuth retries finalize on merge_retryable_error then reaches terminal state
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] BlockStatement
hooks/use-auth.tsx:165:13
           if (
             payload.status !== "pending_auth" &&
             payload.status !== "merge_retryable_error"
-          ) {
-            emitMergeComplete(payload.status);
-            return payload.status;
-          }
+          ) {}
         } catch (error) {
           console.error("[auth] finalize merge state failed:", error);
killedBy: useAuth signInWithPassword finalizes merge state for authenticated sessions
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] BlockStatement
hooks/use-auth.tsx:169:25
             emitMergeComplete(payload.status);
             return payload.status;
           }
-        } catch (error) {
-          console.error("[auth] finalize merge state failed:", error);
-          lastStatus = "merge_retryable_error";
-          await wait(Math.min(300 * 2 ** (attempt - 1), 3000));
-          continue;
-        }
+        } catch (error) {}
 
         await wait(Math.min(300 * 2 ** (attempt - 1), 3000));

[Survived] StringLiteral
hooks/use-auth.tsx:171:24
           }
         } catch (error) {
           console.error("[auth] finalize merge state failed:", error);
-          lastStatus = "merge_retryable_error";
+          lastStatus = "";
           await wait(Math.min(300 * 2 ** (attempt - 1), 3000));
           continue;

[Killed] MethodExpression
hooks/use-auth.tsx:176:20
           continue;
         }
 
-        await wait(Math.min(300 * 2 ** (attempt - 1), 3000));
+        await wait(Math.max(300 * 2 ** (attempt - 1), 3000));
       }
 
killedBy: useAuth retries merge finalization after pending_auth auth-state callback
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] ArithmeticOperator
hooks/use-auth.tsx:176:41
           continue;
         }
 
-        await wait(Math.min(300 * 2 ** (attempt - 1), 3000));
+        await wait(Math.min(300 * 2 ** (attempt + 1), 3000));
       }
 
killedBy: useAuth retries merge finalization after pending_auth auth-state callback
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[NoCoverage] EqualityOperator
hooks/use-auth.tsx:180:9
       }
 
       if (
-        lastStatus === "pending_auth" ||
+        lastStatus !== "pending_auth" ||
         lastStatus === "merge_retryable_error"
       ) {

[NoCoverage] ConditionalExpression
hooks/use-auth.tsx:180:9
       }
 
       if (
-        lastStatus === "pending_auth" ||
-        lastStatus === "merge_retryable_error"
+        true
       ) {
         console.warn("[auth] merge finalize timed out before terminal state", {

[NoCoverage] ConditionalExpression
hooks/use-auth.tsx:181:9
 
       if (
         lastStatus === "pending_auth" ||
-        lastStatus === "merge_retryable_error"
+        false
       ) {
         console.warn("[auth] merge finalize timed out before terminal state", {

[NoCoverage] EqualityOperator
hooks/use-auth.tsx:181:9
 
       if (
         lastStatus === "pending_auth" ||
-        lastStatus === "merge_retryable_error"
+        lastStatus !== "merge_retryable_error"
       ) {
         console.warn("[auth] merge finalize timed out before terminal state", {

[NoCoverage] BlockStatement
hooks/use-auth.tsx:182:9
       if (
         lastStatus === "pending_auth" ||
         lastStatus === "merge_retryable_error"
-      ) {
-        console.warn("[auth] merge finalize timed out before terminal state", {
-          lastStatus,
-        });
-      }
+      ) {}
       return lastStatus;
     })();

[NoCoverage] StringLiteral
hooks/use-auth.tsx:183:22
         lastStatus === "pending_auth" ||
         lastStatus === "merge_retryable_error"
       ) {
-        console.warn("[auth] merge finalize timed out before terminal state", {
+        console.warn("", {
           lastStatus,
         });

[Survived] BlockStatement
hooks/use-auth.tsx:190:9
       return lastStatus;
     })();
 
-    try {
-      return await finalizeMergeRef.current;
-    } finally {
+    try {} finally {
       finalizeMergeRef.current = null;
     }

[Survived] BlockStatement
hooks/use-auth.tsx:192:15
 
     try {
       return await finalizeMergeRef.current;
-    } finally {
-      finalizeMergeRef.current = null;
-    }
+    } finally {}
   }, [emitMergeComplete]);
 

[Killed] ConditionalExpression
hooks/use-auth.tsx:198:9
   }, [emitMergeComplete]);
 
   const ensureSession = useCallback(async (): Promise<User | null> => {
-    if (ensureSessionRef.current) {
+    if (true) {
       return ensureSessionRef.current;
     }
killedBy: useAuth bootstraps anonymous session through ensureSession
statusReason: expected null to deeply equal { id: 'anon-user', is_anonymous: true }

[NoCoverage] BlockStatement
hooks/use-auth.tsx:198:35
   }, [emitMergeComplete]);
 
   const ensureSession = useCallback(async (): Promise<User | null> => {
-    if (ensureSessionRef.current) {
-      return ensureSessionRef.current;
-    }
+    if (ensureSessionRef.current) {}
 
     ensureSessionRef.current = (async () => {

[Killed] OptionalChaining
hooks/use-auth.tsx:207:11
         data: { session },
       } = await supabase.auth.getSession();
 
-      if (session?.user) {
+      if (session.user) {
         setUser(session.user);
         if (!isAnonymousUser(session.user)) {
killedBy: useAuth bootstraps anonymous session through ensureSession
statusReason: Cannot read properties of null (reading 'user')

[Killed] ConditionalExpression
hooks/use-auth.tsx:207:11
         data: { session },
       } = await supabase.auth.getSession();
 
-      if (session?.user) {
+      if (true) {
         setUser(session.user);
         if (!isAnonymousUser(session.user)) {
killedBy: useAuth bootstraps anonymous session through ensureSession
statusReason: Cannot read properties of null (reading 'user')

[NoCoverage] BooleanLiteral
hooks/use-auth.tsx:209:13
 
       if (session?.user) {
         setUser(session.user);
-        if (!isAnonymousUser(session.user)) {
+        if (isAnonymousUser(session.user)) {
           void finalizeAnonymousMergeState();
         }

[NoCoverage] ConditionalExpression
hooks/use-auth.tsx:209:13
 
       if (session?.user) {
         setUser(session.user);
-        if (!isAnonymousUser(session.user)) {
+        if (false) {
           void finalizeAnonymousMergeState();
         }

[Killed] BooleanLiteral
hooks/use-auth.tsx:215:11
         return session.user;
       }
 
-      if (!ENABLE_ANONYMOUS_AUTH) {
+      if (ENABLE_ANONYMOUS_AUTH) {
         setUser(null);
         return null;
killedBy: useAuth bootstraps anonymous session through ensureSession
statusReason: expected null to deeply equal { id: 'anon-user', is_anonymous: true }

[Killed] ConditionalExpression
hooks/use-auth.tsx:215:11
         return session.user;
       }
 
-      if (!ENABLE_ANONYMOUS_AUTH) {
+      if (true) {
         setUser(null);
         return null;
killedBy: useAuth bootstraps anonymous session through ensureSession
statusReason: expected null to deeply equal { id: 'anon-user', is_anonymous: true }

[Killed] ConditionalExpression
hooks/use-auth.tsx:221:11
       }
 
       const { data, error } = await supabase.auth.signInAnonymously();
-      if (error) {
+      if (true) {
         console.error("[auth] signInAnonymously failed:", error.message);
         setUser(null);
killedBy: useAuth bootstraps anonymous session through ensureSession
statusReason: Cannot read properties of null (reading 'message')

[Survived] ConditionalExpression
hooks/use-auth.tsx:221:11
       }
 
       const { data, error } = await supabase.auth.signInAnonymously();
-      if (error) {
+      if (false) {
         console.error("[auth] signInAnonymously failed:", error.message);
         setUser(null);

[Survived] StringLiteral
hooks/use-auth.tsx:222:23
 
       const { data, error } = await supabase.auth.signInAnonymously();
       if (error) {
-        console.error("[auth] signInAnonymously failed:", error.message);
+        console.error("", error.message);
         setUser(null);
         return null;

[Killed] LogicalOperator
hooks/use-auth.tsx:227:24
         return null;
       }
 
-      const anonUser = data.user ?? null;
+      const anonUser = data.user && null;
       setUser(anonUser);
       return anonUser;
killedBy: useAuth bootstraps anonymous session through ensureSession
statusReason: expected null to deeply equal { id: 'anon-user', is_anonymous: true }

[Killed] BlockStatement
hooks/use-auth.tsx:232:9
       return anonUser;
     })();
 
-    try {
-      return await ensureSessionRef.current;
-    } finally {
+    try {} finally {
       ensureSessionRef.current = null;
       setIsLoading(false);
killedBy: useAuth bootstraps anonymous session through ensureSession
statusReason: expected undefined to deeply equal { id: 'anon-user', is_anonymous: true }

[Survived] BlockStatement
hooks/use-auth.tsx:234:15
 
     try {
       return await ensureSessionRef.current;
-    } finally {
-      ensureSessionRef.current = null;
-      setIsLoading(false);
-      setSessionReady(true);
-    }
+    } finally {}
   }, [finalizeAnonymousMergeState, supabase]);
 

[Survived] BooleanLiteral
hooks/use-auth.tsx:236:20
       return await ensureSessionRef.current;
     } finally {
       ensureSessionRef.current = null;
-      setIsLoading(false);
+      setIsLoading(true);
       setSessionReady(true);
     }

[Survived] BooleanLiteral
hooks/use-auth.tsx:237:23
     } finally {
       ensureSessionRef.current = null;
       setIsLoading(false);
-      setSessionReady(true);
+      setSessionReady(false);
     }
   }, [finalizeAnonymousMergeState, supabase]);
