[Survived] ArrayDeclaration
hooks/use-auth.tsx:239:6
       setIsLoading(false);
       setSessionReady(true);
     }
-  }, [finalizeAnonymousMergeState, supabase]);
+  }, []);
 
   useEffect(() => {

[Killed] BlockStatement
hooks/use-auth.tsx:244:18
   useEffect(() => {
     let mounted = true;
 
-    (async () => {
-      const {
-        data: { session },
-      } = await supabase.auth.getSession();
-
-      if (!mounted) return;
-      const initialUser = session?.user ?? null;
-      setUser(initialUser);
-      setIsLoading(false);
-      setSessionReady(true);
-
-      if (initialUser && !isAnonymousUser(initialUser)) {
-        void finalizeAnonymousMergeState();
-      }
-    })();
+    (async () => {})();
 
     const {
killedBy: useAuth bootstraps anonymous session through ensureSession
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BooleanLiteral
hooks/use-auth.tsx:249:11
         data: { session },
       } = await supabase.auth.getSession();
 
-      if (!mounted) return;
+      if (mounted) return;
       const initialUser = session?.user ?? null;
       setUser(initialUser);
killedBy: useAuth bootstraps anonymous session through ensureSession
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
hooks/use-auth.tsx:249:11
         data: { session },
       } = await supabase.auth.getSession();
 
-      if (!mounted) return;
+      if (true) return;
       const initialUser = session?.user ?? null;
       setUser(initialUser);
killedBy: useAuth bootstraps anonymous session through ensureSession
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] LogicalOperator
hooks/use-auth.tsx:250:27
       } = await supabase.auth.getSession();
 
       if (!mounted) return;
-      const initialUser = session?.user ?? null;
+      const initialUser = session?.user && null;
       setUser(initialUser);
       setIsLoading(false);
killedBy: useAuth signOut clears user state
statusReason: expected null not to be null

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] OptionalChaining
hooks/use-auth.tsx:250:27
       } = await supabase.auth.getSession();
 
       if (!mounted) return;
-      const initialUser = session?.user ?? null;
+      const initialUser = session.user ?? null;
       setUser(initialUser);
       setIsLoading(false);
killedBy: useAuth bootstraps anonymous session through ensureSession
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Survived] BooleanLiteral
hooks/use-auth.tsx:252:20
       if (!mounted) return;
       const initialUser = session?.user ?? null;
       setUser(initialUser);
-      setIsLoading(false);
+      setIsLoading(true);
       setSessionReady(true);
 

[Killed] ConditionalExpression
hooks/use-auth.tsx:255:11
       setIsLoading(false);
       setSessionReady(true);
 
-      if (initialUser && !isAnonymousUser(initialUser)) {
+      if (true) {
         void finalizeAnonymousMergeState();
       }
killedBy: useAuth signInWithPassword finalizes merge state for authenticated sessions
statusReason: expected MergePreparationError: Could not secure c… to be null

[Killed] LogicalOperator
hooks/use-auth.tsx:255:11
       setIsLoading(false);
       setSessionReady(true);
 
-      if (initialUser && !isAnonymousUser(initialUser)) {
+      if (initialUser || !isAnonymousUser(initialUser)) {
         void finalizeAnonymousMergeState();
       }
killedBy: useAuth signInWithPassword finalizes merge state for authenticated sessions
statusReason: expected MergePreparationError: Could not secure c… to be null

[Killed] BlockStatement
hooks/use-auth.tsx:262:61
 
     const {
       data: { subscription },
-    } = supabase.auth.onAuthStateChange((event, session) => {
-      const nextUser = session?.user ?? null;
-      setUser(nextUser);
-      setIsLoading(false);
-      setSessionReady(true);
-
-      if (
-        nextUser &&
-        !isAnonymousUser(nextUser) &&
-        (event === "SIGNED_IN" || event === "TOKEN_REFRESHED" || event === "USER_UPDATED")
-      ) {
-        void finalizeAnonymousMergeState();
-      }
-    });
+    } = supabase.auth.onAuthStateChange((event, session) => {});
 
     return () => {
killedBy: useAuth retries merge finalization after pending_auth auth-state callback
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Killed] LogicalOperator
hooks/use-auth.tsx:263:24
     const {
       data: { subscription },
     } = supabase.auth.onAuthStateChange((event, session) => {
-      const nextUser = session?.user ?? null;
+      const nextUser = session?.user && null;
       setUser(nextUser);
       setIsLoading(false);
killedBy: useAuth retries merge finalization after pending_auth auth-state callback
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Survived] OptionalChaining
hooks/use-auth.tsx:263:24
     const {
       data: { subscription },
     } = supabase.auth.onAuthStateChange((event, session) => {
-      const nextUser = session?.user ?? null;
+      const nextUser = session.user ?? null;
       setUser(nextUser);
       setIsLoading(false);

[Survived] BooleanLiteral
hooks/use-auth.tsx:265:20
     } = supabase.auth.onAuthStateChange((event, session) => {
       const nextUser = session?.user ?? null;
       setUser(nextUser);
-      setIsLoading(false);
+      setIsLoading(true);
       setSessionReady(true);
 

[Killed] ConditionalExpression
hooks/use-auth.tsx:269:9
       setSessionReady(true);
 
       if (
-        nextUser &&
-        !isAnonymousUser(nextUser) &&
-        (event === "SIGNED_IN" || event === "TOKEN_REFRESHED" || event === "USER_UPDATED")
+        false
       ) {
         void finalizeAnonymousMergeState();
killedBy: useAuth retries merge finalization after pending_auth auth-state callback
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Killed] ConditionalExpression
hooks/use-auth.tsx:269:9
       setSessionReady(true);
 
       if (
-        nextUser &&
-        !isAnonymousUser(nextUser) &&
-        (event === "SIGNED_IN" || event === "TOKEN_REFRESHED" || event === "USER_UPDATED")
+        true
       ) {
         void finalizeAnonymousMergeState();
killedBy: useAuth does not finalize merge for anonymous users on auth state change
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "/auth/callback",

[Killed] BooleanLiteral
hooks/use-auth.tsx:270:9
 
       if (
         nextUser &&
-        !isAnonymousUser(nextUser) &&
+        isAnonymousUser(nextUser) &&
         (event === "SIGNED_IN" || event === "TOKEN_REFRESHED" || event === "USER_UPDATED")
       ) {
killedBy: useAuth retries merge finalization after pending_auth auth-state callback
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Killed] LogicalOperator
hooks/use-auth.tsx:271:10
       if (
         nextUser &&
         !isAnonymousUser(nextUser) &&
-        (event === "SIGNED_IN" || event === "TOKEN_REFRESHED" || event === "USER_UPDATED")
+        (event === "SIGNED_IN" && event === "TOKEN_REFRESHED" || event === "USER_UPDATED")
       ) {
         void finalizeAnonymousMergeState();
killedBy: useAuth retries merge finalization after pending_auth auth-state callback
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Killed] EqualityOperator
hooks/use-auth.tsx:271:10
       if (
         nextUser &&
         !isAnonymousUser(nextUser) &&
-        (event === "SIGNED_IN" || event === "TOKEN_REFRESHED" || event === "USER_UPDATED")
+        (event !== "SIGNED_IN" || event === "TOKEN_REFRESHED" || event === "USER_UPDATED")
       ) {
         void finalizeAnonymousMergeState();
killedBy: useAuth retries merge finalization after pending_auth auth-state callback
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Killed] BlockStatement
hooks/use-auth.tsx:272:9
         nextUser &&
         !isAnonymousUser(nextUser) &&
         (event === "SIGNED_IN" || event === "TOKEN_REFRESHED" || event === "USER_UPDATED")
-      ) {
-        void finalizeAnonymousMergeState();
-      }
+      ) {}
     });
 
killedBy: useAuth retries merge finalization after pending_auth auth-state callback
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Survived] BlockStatement
hooks/use-auth.tsx:277:18
       }
     });
 
-    return () => {
-      mounted = false;
-      subscription.unsubscribe();
-    };
+    return () => {};
   }, [finalizeAnonymousMergeState, supabase]);
 

[Survived] BooleanLiteral
hooks/use-auth.tsx:278:17
     });
 
     return () => {
-      mounted = false;
+      mounted = true;
       subscription.unsubscribe();
     };

[Killed] BlockStatement
hooks/use-auth.tsx:283:73
     };
   }, [finalizeAnonymousMergeState, supabase]);
 
-  const signInWithPassword = async (email: string, password: string) => {
-    const prepared = await prepareAnonymousMergeState();
-    if (!prepared) {
-      return { error: buildMergePreparationError() };
-    }
-
-    const { data, error } = await supabase.auth.signInWithPassword({
-      email,
-      password,
-    });
-
-    if (!error) {
-      const sessionUser =
-        data.session?.user ??
-        (await supabase.auth.getSession()).data.session?.user ??
-        null;
-
-      if (sessionUser && !isAnonymousUser(sessionUser)) {
-        await finalizeAnonymousMergeState();
-      }
-    }
-
-    return { error: error as Error | null };
-  };
+  const signInWithPassword = async (email: string, password: string) => {};
 
   const signUp = async (
killedBy: useAuth returns MergePreparationError when merge prep endpoint fails
statusReason: expected undefined to be 'MergePreparationError' // Object.is equality

[Killed] ConditionalExpression
hooks/use-auth.tsx:285:9
 
   const signInWithPassword = async (email: string, password: string) => {
     const prepared = await prepareAnonymousMergeState();
-    if (!prepared) {
+    if (true) {
       return { error: buildMergePreparationError() };
     }
killedBy: useAuth signInWithPassword finalizes merge state for authenticated sessions
statusReason: expected MergePreparationError: Could not secure c… to be null

[Killed] ConditionalExpression
hooks/use-auth.tsx:285:9
 
   const signInWithPassword = async (email: string, password: string) => {
     const prepared = await prepareAnonymousMergeState();
-    if (!prepared) {
+    if (false) {
       return { error: buildMergePreparationError() };
     }
killedBy: useAuth returns MergePreparationError when merge prep endpoint fails
statusReason: expected undefined to be 'MergePreparationError' // Object.is equality

[Killed] BlockStatement
hooks/use-auth.tsx:294:17
       password,
     });
 
-    if (!error) {
-      const sessionUser =
-        data.session?.user ??
-        (await supabase.auth.getSession()).data.session?.user ??
-        null;
-
-      if (sessionUser && !isAnonymousUser(sessionUser)) {
-        await finalizeAnonymousMergeState();
-      }
-    }
+    if (!error) {}
 
     return { error: error as Error | null };
killedBy: useAuth signInWithPassword finalizes merge state for authenticated sessions
statusReason: expected 2nd "vi.fn()" call to have been called with [ '/auth/callback', …(1) ], but called only 1 times

[Killed] ConditionalExpression
hooks/use-auth.tsx:294:9
       password,
     });
 
-    if (!error) {
+    if (false) {
       const sessionUser =
         data.session?.user ??
killedBy: useAuth signInWithPassword finalizes merge state for authenticated sessions
statusReason: expected 2nd "vi.fn()" call to have been called with [ '/auth/callback', …(1) ], but called only 1 times

[Killed] LogicalOperator
hooks/use-auth.tsx:296:9
 
     if (!error) {
       const sessionUser =
-        data.session?.user ??
-        (await supabase.auth.getSession()).data.session?.user ??
+        data.session?.user && (await supabase.auth.getSession()).data.session?.user ??
         null;
 
killedBy: useAuth signInWithPassword finalizes merge state for authenticated sessions
statusReason: expected 2nd "vi.fn()" call to have been called with [ '/auth/callback', …(1) ], but called only 1 times

[Killed] LogicalOperator
hooks/use-auth.tsx:296:9
 
     if (!error) {
       const sessionUser =
-        data.session?.user ??
-        (await supabase.auth.getSession()).data.session?.user ??
-        null;
+        (data.session?.user ?? (await supabase.auth.getSession()).data.session?.user) && null;
 
       if (sessionUser && !isAnonymousUser(sessionUser)) {
killedBy: useAuth signInWithPassword finalizes merge state for authenticated sessions
statusReason: expected 2nd "vi.fn()" call to have been called with [ '/auth/callback', …(1) ], but called only 1 times

[NoCoverage] OptionalChaining
hooks/use-auth.tsx:297:9
     if (!error) {
       const sessionUser =
         data.session?.user ??
-        (await supabase.auth.getSession()).data.session?.user ??
+        (await supabase.auth.getSession()).data.session.user ??
         null;
 

[Killed] BlockStatement
hooks/use-auth.tsx:300:57
         (await supabase.auth.getSession()).data.session?.user ??
         null;
 
-      if (sessionUser && !isAnonymousUser(sessionUser)) {
-        await finalizeAnonymousMergeState();
-      }
+      if (sessionUser && !isAnonymousUser(sessionUser)) {}
     }
 
killedBy: useAuth signInWithPassword finalizes merge state for authenticated sessions
statusReason: expected 2nd "vi.fn()" call to have been called with [ '/auth/callback', …(1) ], but called only 1 times

[Killed] ConditionalExpression
hooks/use-auth.tsx:300:11
         (await supabase.auth.getSession()).data.session?.user ??
         null;
 
-      if (sessionUser && !isAnonymousUser(sessionUser)) {
+      if (false) {
         await finalizeAnonymousMergeState();
       }
killedBy: useAuth signInWithPassword finalizes merge state for authenticated sessions
statusReason: expected 2nd "vi.fn()" call to have been called with [ '/auth/callback', …(1) ], but called only 1 times

[Killed] BooleanLiteral
hooks/use-auth.tsx:314:9
     username?: string
   ) => {
     const prepared = await prepareAnonymousMergeState();
-    if (!prepared) {
+    if (prepared) {
       return { error: buildMergePreparationError() };
     }
killedBy: useAuth signUp finalizes merge state for authenticated sessions
statusReason: expected MergePreparationError: Could not secure c… to be null

[Killed] ObjectLiteral
hooks/use-auth.tsx:317:56
     if (!prepared) {
       return { error: buildMergePreparationError() };
     }
-    const { data, error } = await supabase.auth.signUp({
-      email,
-      password,
-      options: {
-        data: { username: username || email.split("@")[0] },
-        emailRedirectTo: getAuthCallbackUrl(),
-      },
-    });
+    const { data, error } = await supabase.auth.signUp({});
 
     if (!error) {
killedBy: useAuth signUp finalizes merge state for authenticated sessions
statusReason: expected "vi.fn()" to be called with arguments: [ { email: 'user@example.com', …(2) } ]

Received: 

  1st vi.fn() call:

  [
-   {

[Killed] ConditionalExpression
hooks/use-auth.tsx:321:27
       email,
       password,
       options: {
-        data: { username: username || email.split("@")[0] },
+        data: { username: false },
         emailRedirectTo: getAuthCallbackUrl(),
       },
killedBy: useAuth signUp finalizes merge state for authenticated sessions
statusReason: expected "vi.fn()" to be called with arguments: [ { email: 'user@example.com', …(2) } ]

Received: 

  1st vi.fn() call:

@@ -1,11 +1,11 @@
  [

[Killed] LogicalOperator
hooks/use-auth.tsx:321:27
       email,
       password,
       options: {
-        data: { username: username || email.split("@")[0] },
+        data: { username: username && email.split("@")[0] },
         emailRedirectTo: getAuthCallbackUrl(),
       },
killedBy: useAuth signUp finalizes merge state for authenticated sessions
statusReason: expected "vi.fn()" to be called with arguments: [ { email: 'user@example.com', …(2) } ]

Received: 

  1st vi.fn() call:

@@ -1,11 +1,11 @@
  [

[Killed] OptionalChaining
hooks/use-auth.tsx:328:9
 
     if (!error) {
       const sessionUser =
-        data.session?.user ??
+        data.session.user ??
         (await supabase.auth.getSession()).data.session?.user ??
         null;
killedBy: useAuth uses email prefix as default username when signUp username is omitted
statusReason: Cannot read properties of null (reading 'user')

[Killed] BooleanLiteral
hooks/use-auth.tsx:332:26
         (await supabase.auth.getSession()).data.session?.user ??
         null;
 
-      if (sessionUser && !isAnonymousUser(sessionUser)) {
+      if (sessionUser && isAnonymousUser(sessionUser)) {
         await finalizeAnonymousMergeState();
       }
killedBy: useAuth signUp finalizes merge state for authenticated sessions
statusReason: expected 2nd "vi.fn()" call to have been called with [ '/auth/callback', …(1) ], but called only 1 times

[Killed] BlockStatement
hooks/use-auth.tsx:340:40
     return { error: error as Error | null };
   };
 
-  const signInWithGoogle = async () => {
-    const prepared = await prepareAnonymousMergeState();
-    if (!prepared) {
-      return { error: buildMergePreparationError() };
-    }
-
-    const nextPath = `${window.location.pathname}${window.location.search}`;
-    const { error } = await supabase.auth.signInWithOAuth({
-      provider: "google",
-      options: {
-        redirectTo: getAuthCallbackUrl(nextPath),
-      },
-    });
-    return { error: error as Error | null };
-  };
+  const signInWithGoogle = async () => {};
 
   const signOut = async () => {
killedBy: useAuth signInWithGoogle forwards current path through callback redirect
statusReason: expected undefined to be null

[NoCoverage] ObjectLiteral
hooks/use-auth.tsx:343:14
   const signInWithGoogle = async () => {
     const prepared = await prepareAnonymousMergeState();
     if (!prepared) {
-      return { error: buildMergePreparationError() };
+      return {};
     }
 

[Killed] ObjectLiteral
hooks/use-auth.tsx:347:59
     }
 
     const nextPath = `${window.location.pathname}${window.location.search}`;
-    const { error } = await supabase.auth.signInWithOAuth({
-      provider: "google",
-      options: {
-        redirectTo: getAuthCallbackUrl(nextPath),
-      },
-    });
+    const { error } = await supabase.auth.signInWithOAuth({});
     return { error: error as Error | null };
   };
killedBy: useAuth signInWithGoogle forwards current path through callback redirect
statusReason: expected "vi.fn()" to be called with arguments: [ '/s/E2ESMOKE1?filter=mine' ]

Number of calls: 0

[Killed] ObjectLiteral
hooks/use-auth.tsx:353:12
         redirectTo: getAuthCallbackUrl(nextPath),
       },
     });
-    return { error: error as Error | null };
+    return {};
   };
 
killedBy: useAuth signInWithGoogle forwards current path through callback redirect
statusReason: expected undefined to be null

[Killed] BlockStatement
hooks/use-auth.tsx:356:31
     return { error: error as Error | null };
   };
 
-  const signOut = async () => {
-    await supabase.auth.signOut();
-    setUser(null);
-    setIsLoading(false);
-    setSessionReady(true);
-  };
+  const signOut = async () => {};
 
   const resetPassword = async (email: string) => {
killedBy: useAuth signOut clears user state
statusReason: expected { Object (id, is_anonymous) } to be null

[Survived] BooleanLiteral
hooks/use-auth.tsx:359:18
   const signOut = async () => {
     await supabase.auth.signOut();
     setUser(null);
-    setIsLoading(false);
+    setIsLoading(true);
     setSessionReady(true);
   };

[Killed] BlockStatement
hooks/use-auth.tsx:363:50
     setSessionReady(true);
   };
 
-  const resetPassword = async (email: string) => {
-    const { error } = await supabase.auth.resetPasswordForEmail(email, {
-      redirectTo: getAuthCallbackUrl("/reset-password"),
-    });
-    return { error: error as Error | null };
-  };
+  const resetPassword = async (email: string) => {};
 
   const isAnonymous = isAnonymousUser(user);
killedBy: useAuth resetPassword calls resetPasswordForEmail with redirect URL
statusReason: expected undefined to be null

[Killed] StringLiteral
hooks/use-auth.tsx:365:38
 
   const resetPassword = async (email: string) => {
     const { error } = await supabase.auth.resetPasswordForEmail(email, {
-      redirectTo: getAuthCallbackUrl("/reset-password"),
+      redirectTo: getAuthCallbackUrl(""),
     });
     return { error: error as Error | null };
killedBy: useAuth resetPassword calls resetPasswordForEmail with redirect URL
statusReason: expected "vi.fn()" to be called with arguments: [ 'user@example.com', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "user@example.com",

[Survived] ConditionalExpression
hooks/use-auth.tsx:371:39
   };
 
   const isAnonymous = isAnonymousUser(user);
-  const isAuthenticatedUser = Boolean(user && !isAnonymous);
+  const isAuthenticatedUser = Boolean(false);
 
   return (

[Survived] ConditionalExpression
hooks/use-auth.tsx:371:39
   };
 
   const isAnonymous = isAnonymousUser(user);
-  const isAuthenticatedUser = Boolean(user && !isAnonymous);
+  const isAuthenticatedUser = Boolean(true);
 
   return (

[Killed] BlockStatement
hooks/use-auth.tsx:394:27
   );
 }
 
-export function useAuth() {
-  const context = useContext(AuthContext);
-  if (!context) {
-    throw new Error("useAuth must be used within an AuthProvider");
-  }
-  return context;
-}
+export function useAuth() {}
 
killedBy: useAuth bootstraps anonymous session through ensureSession
statusReason: expected undefined to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>
