[Killed] BlockStatement
lib/actions/events.ts:493:55
   return {};
 }
 
-export async function archiveEvent(shortCode: string) {
-  const result = await runEventMutation(shortCode, "set_event_archive", {
-    p_is_archived: true,
-  });
-  if (result.error) return result;
-
-  revalidatePath(`/s/${shortCode}`);
-  revalidatePath("/");
-  revalidatePath("/browse");
-  revalidatePath("/my-circles");
-  return {};
-}
+export async function archiveEvent(shortCode: string) {}
 
 export async function unarchiveEvent(shortCode: string) {
killedBy: event mutation actions rejects invalid short codes before calling supabase
statusReason: expected undefined to deeply equal { error: 'Invalid input' }

[Killed] StringLiteral
lib/actions/events.ts:494:52
 }
 
 export async function archiveEvent(shortCode: string) {
-  const result = await runEventMutation(shortCode, "set_event_archive", {
+  const result = await runEventMutation(shortCode, "", {
     p_is_archived: true,
   });
killedBy: event mutation actions returns rpc errors for archiveEvent
statusReason: expected "vi.fn()" to be called with arguments: [ 'set_event_archive', …(1) ]

Received: 

  1st vi.fn() call:

  [
-   "set_event_archive",

[Killed] BooleanLiteral
lib/actions/events.ts:495:20
 
 export async function archiveEvent(shortCode: string) {
   const result = await runEventMutation(shortCode, "set_event_archive", {
-    p_is_archived: true,
+    p_is_archived: false,
   });
   if (result.error) return result;
killedBy: event mutation actions returns rpc errors for archiveEvent
statusReason: expected "vi.fn()" to be called with arguments: [ 'set_event_archive', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "set_event_archive",

[Killed] ConditionalExpression
lib/actions/events.ts:497:7
   const result = await runEventMutation(shortCode, "set_event_archive", {
     p_is_archived: true,
   });
-  if (result.error) return result;
+  if (true) return result;
 
   revalidatePath(`/s/${shortCode}`);
killedBy: event mutation actions revalidates all related paths on archive success
statusReason: expected "vi.fn()" to be called with arguments: [ '/s/VALID123' ]

Number of calls: 0

[Killed] ConditionalExpression
lib/actions/events.ts:497:7
   const result = await runEventMutation(shortCode, "set_event_archive", {
     p_is_archived: true,
   });
-  if (result.error) return result;
+  if (false) return result;
 
   revalidatePath(`/s/${shortCode}`);
killedBy: event mutation actions rejects invalid short codes before calling supabase
statusReason: expected {} to deeply equal { error: 'Invalid input' }

[Killed] StringLiteral
lib/actions/events.ts:500:18
   if (result.error) return result;
 
   revalidatePath(`/s/${shortCode}`);
-  revalidatePath("/");
+  revalidatePath("");
   revalidatePath("/browse");
   revalidatePath("/my-circles");
killedBy: event mutation actions revalidates all related paths on archive success
statusReason: expected "vi.fn()" to be called with arguments: [ '/' ]

Received: 

  1st vi.fn() call:

  [
-   "/",

[Killed] BlockStatement
lib/actions/events.ts:506:57
   return {};
 }
 
-export async function unarchiveEvent(shortCode: string) {
-  const result = await runEventMutation(shortCode, "set_event_archive", {
-    p_is_archived: false,
-  });
-  if (result.error) return result;
-
-  revalidatePath(`/s/${shortCode}`);
-  revalidatePath("/");
-  revalidatePath("/browse");
-  revalidatePath("/my-circles");
-  return {};
-}
+export async function unarchiveEvent(shortCode: string) {}
 
 export async function deleteEvent(shortCode: string) {
killedBy: event mutation actions revalidates all related paths on unarchive success
statusReason: expected undefined to deeply equal {}

[Killed] StringLiteral
lib/actions/events.ts:507:52
 }
 
 export async function unarchiveEvent(shortCode: string) {
-  const result = await runEventMutation(shortCode, "set_event_archive", {
+  const result = await runEventMutation(shortCode, "", {
     p_is_archived: false,
   });
killedBy: event mutation actions revalidates all related paths on unarchive success
statusReason: expected "vi.fn()" to be called with arguments: [ 'set_event_archive', …(1) ]

Received: 

  1st vi.fn() call:

  [
-   "set_event_archive",

[Killed] BooleanLiteral
lib/actions/events.ts:508:20
 
 export async function unarchiveEvent(shortCode: string) {
   const result = await runEventMutation(shortCode, "set_event_archive", {
-    p_is_archived: false,
+    p_is_archived: true,
   });
   if (result.error) return result;
killedBy: event mutation actions revalidates all related paths on unarchive success
statusReason: expected "vi.fn()" to be called with arguments: [ 'set_event_archive', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "set_event_archive",

[Killed] BlockStatement
lib/actions/events.ts:519:54
   return {};
 }
 
-export async function deleteEvent(shortCode: string) {
-  const result = await runEventMutation(shortCode, "delete_event_by_shortcode");
-  if (result.error) return result;
-
-  revalidatePath("/");
-  revalidatePath("/browse");
-  revalidatePath("/my-circles");
-  return {};
-}
+export async function deleteEvent(shortCode: string) {}
 
killedBy: event mutation actions revalidates list surfaces on delete success
statusReason: expected undefined to deeply equal {}

[Killed] StringLiteral
lib/actions/events.ts:520:52
 }
 
 export async function deleteEvent(shortCode: string) {
-  const result = await runEventMutation(shortCode, "delete_event_by_shortcode");
+  const result = await runEventMutation(shortCode, "");
   if (result.error) return result;
 
killedBy: event mutation actions revalidates list surfaces on delete success
statusReason: expected "vi.fn()" to be called with arguments: [ 'delete_event_by_shortcode', …(1) ]

Received: 

  1st vi.fn() call:

  [
-   "delete_event_by_shortcode",

[Killed] ConditionalExpression
lib/actions/events.ts:521:7
 
 export async function deleteEvent(shortCode: string) {
   const result = await runEventMutation(shortCode, "delete_event_by_shortcode");
-  if (result.error) return result;
+  if (false) return result;
 
   revalidatePath("/");
killedBy: event mutation actions returns rpc errors for deleteEvent
statusReason: expected {} to deeply equal { error: 'delete failed' }

[Killed] ConditionalExpression
lib/actions/events.ts:521:7
 
 export async function deleteEvent(shortCode: string) {
   const result = await runEventMutation(shortCode, "delete_event_by_shortcode");
-  if (result.error) return result;
+  if (true) return result;
 
   revalidatePath("/");
killedBy: event mutation actions revalidates list surfaces on delete success
statusReason: expected "vi.fn()" to be called with arguments: [ '/' ]

Number of calls: 0
