[Killed] BlockStatement
lib/actions/juz.ts:28:50
   new_khatm_created?: boolean;
 };
 
-function asNumberArray(value: unknown): number[] {
-  if (!Array.isArray(value)) return [];
-  return value
-    .map((item) => Number(item))
-    .filter((item) => Number.isInteger(item) && item >= 1 && item <= 30);
-}
+function asNumberArray(value: unknown): number[] {}
 
 export async function claimMultipleJuz(
killedBy: claimMultipleJuz returns partialError when some juz are claimed and some fail
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BooleanLiteral
lib/actions/juz.ts:29:7
 };
 
 function asNumberArray(value: unknown): number[] {
-  if (!Array.isArray(value)) return [];
+  if (Array.isArray(value)) return [];
   return value
     .map((item) => Number(item))
killedBy: claimMultipleJuz returns partialError when some juz are claimed and some fail
statusReason: expected { claimed: [], newKhatmCreated: false } to deeply equal { claimed: [ 1, 2 ], …(3) }

[Killed] ConditionalExpression
lib/actions/juz.ts:29:7
 };
 
 function asNumberArray(value: unknown): number[] {
-  if (!Array.isArray(value)) return [];
+  if (true) return [];
   return value
     .map((item) => Number(item))
killedBy: claimMultipleJuz returns partialError when some juz are claimed and some fail
statusReason: expected { claimed: [], newKhatmCreated: false } to deeply equal { claimed: [ 1, 2 ], …(3) }

[Killed] MethodExpression
lib/actions/juz.ts:30:10
 
 function asNumberArray(value: unknown): number[] {
   if (!Array.isArray(value)) return [];
-  return value
-    .map((item) => Number(item))
-    .filter((item) => Number.isInteger(item) && item >= 1 && item <= 30);
+  return value.map(item => Number(item));
 }
 
killedBy: claimMultipleJuz handles boundary juz numbers (1 and 30) and strips out-of-range values from result
statusReason: expected { claimed: [ 1, 30 ], …(3) } to deeply equal { claimed: [ 1, 30 ], …(1) }

[Killed] ArrowFunction
lib/actions/juz.ts:31:10
 function asNumberArray(value: unknown): number[] {
   if (!Array.isArray(value)) return [];
   return value
-    .map((item) => Number(item))
+    .map(() => undefined)
     .filter((item) => Number.isInteger(item) && item >= 1 && item <= 30);
 }
killedBy: claimMultipleJuz returns partialError when some juz are claimed and some fail
statusReason: expected { claimed: [], newKhatmCreated: false } to deeply equal { claimed: [ 1, 2 ], …(3) }

[Killed] EqualityOperator
lib/actions/juz.ts:32:62
   if (!Array.isArray(value)) return [];
   return value
     .map((item) => Number(item))
-    .filter((item) => Number.isInteger(item) && item >= 1 && item <= 30);
+    .filter((item) => Number.isInteger(item) && item >= 1 && item < 30);
 }
 
killedBy: claimMultipleJuz handles boundary juz numbers (1 and 30) and strips out-of-range values from result
statusReason: expected { claimed: [ 1 ], …(1) } to deeply equal { claimed: [ 1, 30 ], …(1) }

[Killed] ConditionalExpression
lib/actions/juz.ts:32:23
   if (!Array.isArray(value)) return [];
   return value
     .map((item) => Number(item))
-    .filter((item) => Number.isInteger(item) && item >= 1 && item <= 30);
+    .filter((item) => true);
 }
 
killedBy: claimMultipleJuz handles boundary juz numbers (1 and 30) and strips out-of-range values from result
statusReason: expected { claimed: [ 1, 30 ], …(3) } to deeply equal { claimed: [ 1, 30 ], …(1) }

[Killed] ConditionalExpression
lib/actions/juz.ts:49:7
       claimerName: claimerNameSchema,
     })
     .safeParse({ shortCode, khatmId, juzNumbers, claimerName });
-  if (!parsed.success) return { error: "Invalid input" };
+  if (false) return { error: "Invalid input" };
 
   const supabase = await createClient();
killedBy: claimMultipleJuz returns invalid input when payload fails schema validation
statusReason: Cannot read properties of undefined (reading 'shortCode')

[Killed] BooleanLiteral
lib/actions/juz.ts:49:7
       claimerName: claimerNameSchema,
     })
     .safeParse({ shortCode, khatmId, juzNumbers, claimerName });
-  if (!parsed.success) return { error: "Invalid input" };
+  if (parsed.success) return { error: "Invalid input" };
 
   const supabase = await createClient();
killedBy: claimMultipleJuz returns rpc error when claim_juz_batch fails
statusReason: expected { error: 'Invalid input' } to deeply equal { error: 'This Khatim is archived' }

[Killed] ObjectLiteral
lib/actions/juz.ts:52:65
   if (!parsed.success) return { error: "Invalid input" };
 
   const supabase = await createClient();
-  const { data, error } = await supabase.rpc("claim_juz_batch", {
-    p_short_code: parsed.data.shortCode,
-    p_khatm_id: parsed.data.khatmId,
-    p_juz_numbers: parsed.data.juzNumbers,
-    p_claimer_name: parsed.data.claimerName,
-  });
+  const { data, error } = await supabase.rpc("claim_juz_batch", {});
 
   if (error) {
killedBy: claimMultipleJuz returns rpc error when claim_juz_batch fails
statusReason: expected "vi.fn()" to be called with arguments: [ 'claim_juz_batch', { …(4) } ]

Received: 

  1st vi.fn() call:

  [
    "claim_juz_batch",

[Killed] BlockStatement
lib/actions/juz.ts:59:14
     p_claimer_name: parsed.data.claimerName,
   });
 
-  if (error) {
-    return { error: error.message || "Failed to claim juz. Please try again." };
-  }
+  if (error) {}
 
   const result = (data ?? {}) as ClaimBatchResult;
killedBy: claimMultipleJuz returns rpc error when claim_juz_batch fails
statusReason: expected { claimed: [], newKhatmCreated: false } to deeply equal { error: 'This Khatim is archived' }

[Killed] ConditionalExpression
lib/actions/juz.ts:60:21
   });
 
   if (error) {
-    return { error: error.message || "Failed to claim juz. Please try again." };
+    return { error: true };
   }
 
killedBy: claimMultipleJuz returns rpc error when claim_juz_batch fails
statusReason: expected { error: true } to deeply equal { error: 'This Khatim is archived' }

[Killed] ConditionalExpression
lib/actions/juz.ts:60:21
   });
 
   if (error) {
-    return { error: error.message || "Failed to claim juz. Please try again." };
+    return { error: false };
   }
 
killedBy: claimMultipleJuz returns rpc error when claim_juz_batch fails
statusReason: expected { error: false } to deeply equal { error: 'This Khatim is archived' }

[Killed] ConditionalExpression
lib/actions/juz.ts:70:7
 
   revalidatePath(`/s/${shortCode}`);
 
-  if (failed.length > 0 && claimed.length === 0) {
+  if (true) {
     return { error: "All selected juz were already claimed by someone else" };
   }
killedBy: claimMultipleJuz returns partialError when some juz are claimed and some fail
statusReason: expected { Object (error) } to deeply equal { claimed: [ 1, 2 ], …(3) }

[Killed] BlockStatement
lib/actions/juz.ts:70:50
 
   revalidatePath(`/s/${shortCode}`);
 
-  if (failed.length > 0 && claimed.length === 0) {
-    return { error: "All selected juz were already claimed by someone else" };
-  }
+  if (failed.length > 0 && claimed.length === 0) {}
 
   if (failed.length > 0) {
killedBy: claimMultipleJuz returns error when all selected juz fail to claim
statusReason: expected { claimed: [], failed: [ 1, 2 ], …(2) } to deeply equal { Object (error) }

[Killed] EqualityOperator
lib/actions/juz.ts:74:7
     return { error: "All selected juz were already claimed by someone else" };
   }
 
-  if (failed.length > 0) {
+  if (failed.length <= 0) {
     return {
       claimed,
killedBy: claimMultipleJuz returns partialError when some juz are claimed and some fail
statusReason: expected { claimed: [ 1, 2 ], …(1) } to deeply equal { claimed: [ 1, 2 ], …(3) }

[Killed] ConditionalExpression
lib/actions/juz.ts:74:7
     return { error: "All selected juz were already claimed by someone else" };
   }
 
-  if (failed.length > 0) {
+  if (true) {
     return {
       claimed,
killedBy: claimMultipleJuz returns success payload when all selected juz are claimed
statusReason: expected { claimed: [ 4, 5 ], failed: [], …(2) } to deeply equal { claimed: [ 4, 5 ], …(1) }

[Killed] ObjectLiteral
lib/actions/juz.ts:75:12
   }
 
   if (failed.length > 0) {
-    return {
-      claimed,
-      failed,
-      newKhatmCreated,
-      partialError: `Juz ${failed.join(", ")} already claimed by someone else`,
-    };
+    return {};
   }
 
killedBy: claimMultipleJuz returns partialError when some juz are claimed and some fail
statusReason: expected {} to deeply equal { claimed: [ 1, 2 ], …(3) }

[Killed] BlockStatement
lib/actions/juz.ts:86:68
   return { claimed, newKhatmCreated };
 }
 
-export async function unclaimJuz(shortCode: string, juzId: string) {
-  const parsed = z
-    .object({
-      shortCode: shortCodeSchema,
-      juzId: uuidSchema,
-    })
-    .safeParse({ shortCode, juzId });
-  if (!parsed.success) return { error: "Invalid input" };
-
-  const supabase = await createClient();
-  const { error } = await supabase.rpc("unclaim_juz", {
-    p_short_code: parsed.data.shortCode,
-    p_juz_id: parsed.data.juzId,
-  });
-
-  if (error) {
-    return { error: error.message || "Failed to unclaim juz" };
-  }
-
-  revalidatePath(`/s/${shortCode}`);
-  return {};
-}
+export async function unclaimJuz(shortCode: string, juzId: string) {}
 
 export async function markJuzAsRead(shortCode: string, juzId: string) {
killedBy: juz mutation actions validates input before hitting supabase
statusReason: expected undefined to deeply equal { error: 'Invalid input' }

[Killed] BooleanLiteral
lib/actions/juz.ts:93:7
       juzId: uuidSchema,
     })
     .safeParse({ shortCode, juzId });
-  if (!parsed.success) return { error: "Invalid input" };
+  if (parsed.success) return { error: "Invalid input" };
 
   const supabase = await createClient();
killedBy: juz mutation actions validates input before hitting supabase
statusReason: Cannot read properties of undefined (reading 'rpc')

[Killed] ConditionalExpression
lib/actions/juz.ts:93:7
       juzId: uuidSchema,
     })
     .safeParse({ shortCode, juzId });
-  if (!parsed.success) return { error: "Invalid input" };
+  if (true) return { error: "Invalid input" };
 
   const supabase = await createClient();
killedBy: juz mutation actions calls unclaim_juz and revalidates on success
statusReason: expected { error: 'Invalid input' } to deeply equal {}

[Killed] StringLiteral
lib/actions/juz.ts:96:40
   if (!parsed.success) return { error: "Invalid input" };
 
   const supabase = await createClient();
-  const { error } = await supabase.rpc("unclaim_juz", {
+  const { error } = await supabase.rpc("", {
     p_short_code: parsed.data.shortCode,
     p_juz_id: parsed.data.juzId,
killedBy: juz mutation actions calls unclaim_juz and revalidates on success
statusReason: expected "vi.fn()" to be called with arguments: [ 'unclaim_juz', { …(2) } ]

Received: 

  1st vi.fn() call:

  [
-   "unclaim_juz",

[Killed] ObjectLiteral
lib/actions/juz.ts:96:55
   if (!parsed.success) return { error: "Invalid input" };
 
   const supabase = await createClient();
-  const { error } = await supabase.rpc("unclaim_juz", {
-    p_short_code: parsed.data.shortCode,
-    p_juz_id: parsed.data.juzId,
-  });
+  const { error } = await supabase.rpc("unclaim_juz", {});
 
   if (error) {
killedBy: juz mutation actions calls unclaim_juz and revalidates on success
statusReason: expected "vi.fn()" to be called with arguments: [ 'unclaim_juz', { …(2) } ]

Received: 

  1st vi.fn() call:

  [
    "unclaim_juz",

[Killed] BlockStatement
lib/actions/juz.ts:101:14
     p_juz_id: parsed.data.juzId,
   });
 
-  if (error) {
-    return { error: error.message || "Failed to unclaim juz" };
-  }
+  if (error) {}
 
   revalidatePath(`/s/${shortCode}`);
killedBy: juz mutation actions returns fallback errors for unclaim_juz
statusReason: expected {} to deeply equal { error: 'Failed to unclaim juz' }

[Killed] LogicalOperator
lib/actions/juz.ts:102:21
   });
 
   if (error) {
-    return { error: error.message || "Failed to unclaim juz" };
+    return { error: error.message && "Failed to unclaim juz" };
   }
 
killedBy: juz mutation actions returns fallback errors for unclaim_juz
statusReason: expected { error: undefined } to deeply equal { error: 'Failed to unclaim juz' }

[Killed] ConditionalExpression
lib/actions/juz.ts:102:21
   });
 
   if (error) {
-    return { error: error.message || "Failed to unclaim juz" };
+    return { error: true };
   }
 
killedBy: juz mutation actions returns fallback errors for unclaim_juz
statusReason: expected { error: true } to deeply equal { error: 'Failed to unclaim juz' }

[Killed] BlockStatement
lib/actions/juz.ts:109:71
   return {};
 }
 
-export async function markJuzAsRead(shortCode: string, juzId: string) {
-  const parsed = z
-    .object({
-      shortCode: shortCodeSchema,
-      juzId: uuidSchema,
-    })
-    .safeParse({ shortCode, juzId });
-  if (!parsed.success) return { error: "Invalid input" };
-
-  const supabase = await createClient();
-  const { error } = await supabase.rpc("mark_juz_read", {
-    p_short_code: parsed.data.shortCode,
-    p_juz_id: parsed.data.juzId,
-  });
-
-  if (error) {
-    return { error: error.message || "Failed to mark juz as read" };
-  }
-
-  revalidatePath(`/s/${shortCode}`);
-  return {};
-}
+export async function markJuzAsRead(shortCode: string, juzId: string) {}
 
 export async function unmarkJuzAsRead(shortCode: string, juzId: string) {
killedBy: juz mutation actions validates input before hitting supabase
statusReason: expected undefined to deeply equal { error: 'Invalid input' }

[Killed] ObjectLiteral
lib/actions/juz.ts:111:13
 
 export async function markJuzAsRead(shortCode: string, juzId: string) {
   const parsed = z
-    .object({
-      shortCode: shortCodeSchema,
-      juzId: uuidSchema,
-    })
+    .object({})
     .safeParse({ shortCode, juzId });
   if (!parsed.success) return { error: "Invalid input" };
killedBy: juz mutation actions validates input before hitting supabase
statusReason: Cannot read properties of undefined (reading 'rpc')

[Killed] ConditionalExpression
lib/actions/juz.ts:116:7
       juzId: uuidSchema,
     })
     .safeParse({ shortCode, juzId });
-  if (!parsed.success) return { error: "Invalid input" };
+  if (false) return { error: "Invalid input" };
 
   const supabase = await createClient();
killedBy: juz mutation actions validates input before hitting supabase
statusReason: Cannot read properties of undefined (reading 'rpc')

[Killed] BlockStatement
lib/actions/juz.ts:124:14
     p_juz_id: parsed.data.juzId,
   });
 
-  if (error) {
-    return { error: error.message || "Failed to mark juz as read" };
-  }
+  if (error) {}
 
   revalidatePath(`/s/${shortCode}`);
killedBy: juz mutation actions returns fallback errors for mark_juz_read
statusReason: expected {} to deeply equal { error: 'Failed to mark juz as read' }

[Killed] ConditionalExpression
lib/actions/juz.ts:125:21
   });
 
   if (error) {
-    return { error: error.message || "Failed to mark juz as read" };
+    return { error: true };
   }
 
killedBy: juz mutation actions returns fallback errors for mark_juz_read
statusReason: expected { error: true } to deeply equal { error: 'Failed to mark juz as read' }

[Killed] LogicalOperator
lib/actions/juz.ts:125:21
   });
 
   if (error) {
-    return { error: error.message || "Failed to mark juz as read" };
+    return { error: error.message && "Failed to mark juz as read" };
   }
 
killedBy: juz mutation actions returns fallback errors for mark_juz_read
statusReason: expected { error: undefined } to deeply equal { error: 'Failed to mark juz as read' }

[Killed] StringLiteral
lib/actions/juz.ts:128:18
     return { error: error.message || "Failed to mark juz as read" };
   }
 
-  revalidatePath(`/s/${shortCode}`);
+  revalidatePath(``);
   return {};
 }
killedBy: juz mutation actions calls mark_juz_read and revalidates on success
statusReason: expected "vi.fn()" to be called with arguments: [ '/s/E2ESMOKE1' ]

Received: 

  1st vi.fn() call:

  [
-   "/s/E2ESMOKE1",

[Killed] BlockStatement
lib/actions/juz.ts:132:73
   return {};
 }
 
-export async function unmarkJuzAsRead(shortCode: string, juzId: string) {
-  const parsed = z
-    .object({
-      shortCode: shortCodeSchema,
-      juzId: uuidSchema,
-    })
-    .safeParse({ shortCode, juzId });
-  if (!parsed.success) return { error: "Invalid input" };
-
-  const supabase = await createClient();
-  const { error } = await supabase.rpc("unmark_juz_read", {
-    p_short_code: parsed.data.shortCode,
-    p_juz_id: parsed.data.juzId,
-  });
-
-  if (error) {
-    return { error: error.message || "Failed to update juz status" };
-  }
-
-  revalidatePath(`/s/${shortCode}`);
-  return {};
-}
+export async function unmarkJuzAsRead(shortCode: string, juzId: string) {}
 
killedBy: juz mutation actions validates input before hitting supabase
statusReason: expected undefined to deeply equal { error: 'Invalid input' }

[Killed] ObjectLiteral
lib/actions/juz.ts:138:16
       shortCode: shortCodeSchema,
       juzId: uuidSchema,
     })
-    .safeParse({ shortCode, juzId });
+    .safeParse({});
   if (!parsed.success) return { error: "Invalid input" };
 
killedBy: juz mutation actions calls unmark_juz_read and revalidates on success
statusReason: expected { error: 'Invalid input' } to deeply equal {}

[Killed] StringLiteral
lib/actions/juz.ts:142:40
   if (!parsed.success) return { error: "Invalid input" };
 
   const supabase = await createClient();
-  const { error } = await supabase.rpc("unmark_juz_read", {
+  const { error } = await supabase.rpc("", {
     p_short_code: parsed.data.shortCode,
     p_juz_id: parsed.data.juzId,
killedBy: juz mutation actions calls unmark_juz_read and revalidates on success
statusReason: expected "vi.fn()" to be called with arguments: [ 'unmark_juz_read', { …(2) } ]

Received: 

  1st vi.fn() call:

  [
-   "unmark_juz_read",

[Killed] ConditionalExpression
lib/actions/juz.ts:148:21
   });
 
   if (error) {
-    return { error: error.message || "Failed to update juz status" };
+    return { error: false };
   }
 
killedBy: juz mutation actions returns fallback errors for unmark_juz_read
statusReason: expected { error: false } to deeply equal { Object (error) }

[Killed] LogicalOperator
lib/actions/juz.ts:148:21
   });
 
   if (error) {
-    return { error: error.message || "Failed to update juz status" };
+    return { error: error.message && "Failed to update juz status" };
   }
 
killedBy: juz mutation actions returns fallback errors for unmark_juz_read
statusReason: expected { error: undefined } to deeply equal { Object (error) }
