[Killed] BooleanLiteral
app/api/event/route.ts:12:7
   const khatmLimitRaw = searchParams.get("khatmLimit");
   const beforeKhatmNumberRaw = searchParams.get("beforeKhatmNumber");
 
-  if (!shortCode) {
+  if (shortCode) {
     return NextResponse.json(
       {
killedBy: GET /api/event returns missing_short_code when shortCode is omitted
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] ConditionalExpression
app/api/event/route.ts:12:7
   const khatmLimitRaw = searchParams.get("khatmLimit");
   const beforeKhatmNumberRaw = searchParams.get("beforeKhatmNumber");
 
-  if (!shortCode) {
+  if (true) {
     return NextResponse.json(
       {
killedBy: GET /api/event returns invalid_khatm_limit for non-numeric and low values
statusReason: expected { error: { …(2) } } to deeply equal { error: { …(2) } }

[Killed] ObjectLiteral
app/api/event/route.ts:15:16
   if (!shortCode) {
     return NextResponse.json(
       {
-        error: { code: "missing_short_code", message: "Missing shortCode" },
+        error: {},
       },
       { status: 400 }
killedBy: GET /api/event returns missing_short_code when shortCode is omitted
statusReason: expected { error: {} } to deeply equal { error: { …(2) } }

[Killed] ConditionalExpression
app/api/event/route.ts:22:5
   }
 
   const khatmLimit =
-    khatmLimitRaw === null ? undefined : Number.parseInt(khatmLimitRaw, 10);
+    false ? undefined : Number.parseInt(khatmLimitRaw, 10);
   const beforeKhatmNumber =
     beforeKhatmNumberRaw === null
killedBy: GET /api/event accepts valid beforeKhatmNumber=1 as boundary value
statusReason: expected "vi.fn()" to be called with arguments: [ 'VALID123', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "VALID123",

[Killed] EqualityOperator
app/api/event/route.ts:22:5
   }
 
   const khatmLimit =
-    khatmLimitRaw === null ? undefined : Number.parseInt(khatmLimitRaw, 10);
+    khatmLimitRaw !== null ? undefined : Number.parseInt(khatmLimitRaw, 10);
   const beforeKhatmNumber =
     beforeKhatmNumberRaw === null
killedBy: GET /api/event returns invalid_khatm_limit for non-numeric and low values
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] EqualityOperator
app/api/event/route.ts:24:5
   const khatmLimit =
     khatmLimitRaw === null ? undefined : Number.parseInt(khatmLimitRaw, 10);
   const beforeKhatmNumber =
-    beforeKhatmNumberRaw === null
+    beforeKhatmNumberRaw !== null
       ? undefined
       : Number.parseInt(beforeKhatmNumberRaw, 10);
killedBy: GET /api/event returns invalid_before_khatm_number for non-numeric and low values
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] ConditionalExpression
app/api/event/route.ts:24:5
   const khatmLimit =
     khatmLimitRaw === null ? undefined : Number.parseInt(khatmLimitRaw, 10);
   const beforeKhatmNumber =
-    beforeKhatmNumberRaw === null
+    false
       ? undefined
       : Number.parseInt(beforeKhatmNumberRaw, 10);
killedBy: GET /api/event accepts valid khatmLimit=1 as boundary value
statusReason: expected "vi.fn()" to be called with arguments: [ 'VALID123', { khatmLimit: 1, …(1) } ]

Received: 

  1st vi.fn() call:

  [
    "VALID123",

[Killed] EqualityOperator
app/api/event/route.ts:27:7
     beforeKhatmNumberRaw === null
       ? undefined
       : Number.parseInt(beforeKhatmNumberRaw, 10);
-  if (khatmLimitRaw !== null && Number.isNaN(khatmLimit)) {
+  if (khatmLimitRaw === null && Number.isNaN(khatmLimit)) {
     return NextResponse.json(
       {
killedBy: GET /api/event returns invalid_khatm_limit for non-numeric and low values
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] ConditionalExpression
app/api/event/route.ts:27:7
     beforeKhatmNumberRaw === null
       ? undefined
       : Number.parseInt(beforeKhatmNumberRaw, 10);
-  if (khatmLimitRaw !== null && Number.isNaN(khatmLimit)) {
+  if (false) {
     return NextResponse.json(
       {
killedBy: GET /api/event returns invalid_khatm_limit for non-numeric and low values
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] ObjectLiteral
app/api/event/route.ts:35:7
           message: "Invalid khatmLimit",
         },
       },
-      { status: 400 }
+      {}
     );
   }
killedBy: GET /api/event returns invalid_khatm_limit for non-numeric and low values
statusReason: expected 200 to be 400 // Object.is equality

[Killed] BlockStatement
app/api/event/route.ts:38:51
       { status: 400 }
     );
   }
-  if (khatmLimit !== undefined && khatmLimit < 1) {
-    return NextResponse.json(
-      {
-        error: {
-          code: "invalid_khatm_limit",
-          message: "Invalid khatmLimit",
-        },
-      },
-      { status: 400 }
-    );
-  }
+  if (khatmLimit !== undefined && khatmLimit < 1) {}
   if (beforeKhatmNumberRaw !== null && Number.isNaN(beforeKhatmNumber)) {
     return NextResponse.json(
killedBy: GET /api/event returns invalid_khatm_limit for non-numeric and low values
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] LogicalOperator
app/api/event/route.ts:38:7
       { status: 400 }
     );
   }
-  if (khatmLimit !== undefined && khatmLimit < 1) {
+  if (khatmLimit !== undefined || khatmLimit < 1) {
     return NextResponse.json(
       {
killedBy: GET /api/event forwards parsed query args and returns event payload
statusReason: expected 400 to be 200 // Object.is equality

[Killed] StringLiteral
app/api/event/route.ts:42:17
     return NextResponse.json(
       {
         error: {
-          code: "invalid_khatm_limit",
+          code: "",
           message: "Invalid khatmLimit",
         },
killedBy: GET /api/event returns invalid_khatm_limit for non-numeric and low values
statusReason: expected { error: { code: '', …(1) } } to deeply equal { error: { …(2) } }

[Killed] EqualityOperator
app/api/event/route.ts:49:7
       { status: 400 }
     );
   }
-  if (beforeKhatmNumberRaw !== null && Number.isNaN(beforeKhatmNumber)) {
+  if (beforeKhatmNumberRaw === null && Number.isNaN(beforeKhatmNumber)) {
     return NextResponse.json(
       {
killedBy: GET /api/event returns invalid_before_khatm_number for non-numeric and low values
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] BlockStatement
app/api/event/route.ts:49:73
       { status: 400 }
     );
   }
-  if (beforeKhatmNumberRaw !== null && Number.isNaN(beforeKhatmNumber)) {
-    return NextResponse.json(
-      {
-        error: {
-          code: "invalid_before_khatm_number",
-          message: "Invalid beforeKhatmNumber",
-        },
-      },
-      { status: 400 }
-    );
-  }
+  if (beforeKhatmNumberRaw !== null && Number.isNaN(beforeKhatmNumber)) {}
   if (beforeKhatmNumber !== undefined && beforeKhatmNumber < 1) {
     return NextResponse.json(
killedBy: GET /api/event returns invalid_before_khatm_number for non-numeric and low values
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] StringLiteral
app/api/event/route.ts:53:17
     return NextResponse.json(
       {
         error: {
-          code: "invalid_before_khatm_number",
+          code: "",
           message: "Invalid beforeKhatmNumber",
         },
killedBy: GET /api/event returns invalid_before_khatm_number for non-numeric and low values
statusReason: expected { error: { code: '', …(1) } } to deeply equal { error: { …(2) } }

[Killed] ConditionalExpression
app/api/event/route.ts:60:7
       { status: 400 }
     );
   }
-  if (beforeKhatmNumber !== undefined && beforeKhatmNumber < 1) {
+  if (false) {
     return NextResponse.json(
       {
killedBy: GET /api/event returns invalid_before_khatm_number for non-numeric and low values
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] EqualityOperator
app/api/event/route.ts:60:42
       { status: 400 }
     );
   }
-  if (beforeKhatmNumber !== undefined && beforeKhatmNumber < 1) {
+  if (beforeKhatmNumber !== undefined && beforeKhatmNumber <= 1) {
     return NextResponse.json(
       {
killedBy: GET /api/event accepts valid beforeKhatmNumber=1 as boundary value
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ObjectLiteral
app/api/event/route.ts:63:16
   if (beforeKhatmNumber !== undefined && beforeKhatmNumber < 1) {
     return NextResponse.json(
       {
-        error: {
-          code: "invalid_before_khatm_number",
-          message: "Invalid beforeKhatmNumber",
-        },
+        error: {},
       },
       { status: 400 }
killedBy: GET /api/event returns invalid_before_khatm_number for non-numeric and low values
statusReason: expected { error: {} } to deeply equal { error: { …(2) } }

[Killed] StringLiteral
app/api/event/route.ts:65:20
       {
         error: {
           code: "invalid_before_khatm_number",
-          message: "Invalid beforeKhatmNumber",
+          message: "",
         },
       },
killedBy: GET /api/event returns invalid_before_khatm_number for non-numeric and low values
statusReason: expected { error: { …(2) } } to deeply equal { error: { …(2) } }

[Killed] BlockStatement
app/api/event/route.ts:77:19
     beforeKhatmNumber,
   });
 
-  if (!result.ok) {
-    return NextResponse.json(
-      {
-        error: { code: result.code, message: result.message },
-      },
-      { status: result.status }
-    );
-  }
+  if (!result.ok) {}
 
   return NextResponse.json(result.data);
killedBy: GET /api/event maps lookup errors to structured error payload
statusReason: Value is not JSON serializable

[Killed] ObjectLiteral
app/api/event/route.ts:80:16
   if (!result.ok) {
     return NextResponse.json(
       {
-        error: { code: result.code, message: result.message },
+        error: {},
       },
       { status: result.status }
killedBy: GET /api/event maps lookup errors to structured error payload
statusReason: expected { error: {} } to deeply equal { error: { code: 'not_found', …(1) } }
